{
  "tooltips": [
    {
      "title": "alloy_smelter",
      "content": "Used to create EnderIO alloys.  Can also be used as a powered furnace capable of processing up to three items at a time.  There is a button in the GUI to limit the machine to one of those operation types. Upgrade with capacitors to increase speed and energy storage.  Speed is directly related to µI/t."
    },
    {
      "title": "alloys_endergy",
      "content": "Endergy Alloys All alloys listed here can be used to craft grinding balls|Grinding Balls Endergy to enhance the sag mill. Crude Steel Crystalline Alloy Melodic Alloy Stellar Alloy Crystalline Pink Slime Crystalline Pink Slime Blocks can be used as a beacon base. Energetic Silver Vivid Alloy"
    },
    {
      "title": "alloys",
      "content": "All alloys listed here can be used to craft grinding balls to enhance the sag mill. Conductive Iron An alloy of redstone and iron.  It is created in an alloy smelter for 10,000 µI and is used as a crafting component for basic energy conduits, grinding balls, and the electromagnet. Energetic Alloy An alloy of gold, redstone and glowstone dust.  It is created in an alloy smelter for 10,000 µI and is used as a crafting component for advanced energy conduits, grinding balls and a number of advanced machines. Vibrant Alloy An alloy of Energetic alloy and ender pearl.  It is created in an alloy smelter for 10,000 µI and is used as a crafting component for ender energy conduits, and a number of advanced machines. Pulsating Iron An alloy of iron and ender pearl.  It is created in an alloy smelter for 10,000 µI and is used as a crafting component for item conduits, advanced photovoltaic cells and pulsating crystals. Electrical Steel An alloy of iron, coal powder and silicon.  It is created in an alloy smelter for 10,000 µI and is used as a crafting component for a lot of mid tier and advanced machines. Dark Steel An alloy of iron, coal powder and obsidian.  It is created in an alloy smelter for 20,000 µI and is used as a crafting component for dark steel tools and equipment and a number of advanced machines. Solarium An alloy of gold and soul sand.  it is created in an alloy smelter for 10,000 µI and is used as a crafting component for soul vials and a number of souled machines. Redstone Alloy An alloy of redstone and silicon.  It is created in an alloy smelter for 10,000 µI and is used as a crafting component for redstone conduits and redstone filters."
    },
    {
      "title": "api_capacitors",
      "content": "Third party mods can make new capacitors that Ender IO will use just like the built-in ones. There are two ways of doing so: Programmatic and NBT. The programmatic way allows you more control but gives you a compile-time dependency on Ender IO. The NBT way doesn't do either. Programmatic Implement crazypants.enderio.base.capacitor.ICapacitorDataItem on your item. It only has one method, getCapacitorData() . This will be called to retrieve the data object ( ICapacitorData ) from an ItemStack when it is inserted into a machine. The capacitor data will then be queried every time a value is needed (one notable exception is the machine's energy buffer size, which is only set once). ICapacitorData also is a quite simple interface, virtually everything happens in float getUnscaledValue(@Nonnull ICapacitorKey key) . The single parameter is a ICapacitorKey , one of the pre-defined keys in Ender IO that represent all the different values Ender IO's machines have. There's a CapacitorKey for the energy buffer size of the Sagmill, one for the stack size limit of the Farming Station, one for cost of copying a coordinate paper in the Dialing Device, etc. getUnscaledValue() then needs to produce a capacitor level for the CapacitorKey. This is not the final value, but the quality of the capacitor for this specific use. The 3 'normal' capacitors have the levels 1, 2 and 3 for all uses. The level getUnscaledValue() produces should stay between 0 and 5. Values outside this range could produce serious malfunctions. NBT NBT-base capacitors work the same way as programmatic ones, just that there is no getCapacitorData() on the item. Instead the ICapacitorData is created from the NBT tags of the ItemStack. This means that the NBT data has to contain a complete mapping of all possible CapacitorKeys to a capacitor level. To achieve that, the NBT data can contain level data in 4 different ways: LEVEL, TYPE, OWNER+TYPE, NAME. When looking up a value, Ender IO will try to find a value in reverse order. Note: The examples on this page are incomplete NBT snippets and need to be combined according to what's written in the descriptions. TL;DR: Copy&Paste without reading won't work. LEVEL {eiocap:{level:1.111f}} A LEVEL definition is required for all capacitors to be valid. This is the ultimate fallback value. DURABILITY If an item that has durability has a NBT capacitor applied to it, then it will damage the item for 1 point each time the machine it is in completes a task. TYPE {eiocap:{amount:2.222f}}\n{eiocap:{area:2.222f}}\n{eiocap:{energy_buffer:2.222f}}\n{eiocap:{energy_gen:2.222f}}\n{eiocap:{energy_intake:2.222f}}\n{eiocap:{energy_loss:2.222f}}\n{eiocap:{energy_use:2.222f}}\n{eiocap:{speed:2.222f}} Every CapacitorKey has a TYPE. The type is a rough categorization of the purpose of the key. OWNER+TYPE {eiocap:{\"enderio:block_simple_alloy_smelter\":{energy_buffer:2.222f}}}\n{eiocap:{\"enderio:block_simple_alloy_smelter\":{energy_intake:2.222f}}}\n{eiocap:{\"enderio:block_simple_alloy_smelter\":{energy_use:2.222f}}}\n... In addition to a TYPE, capacitor keys are also specific to a machine. NAME {eiocap:{\"enderio:block_simple_alloy_smelter/intake\":2.222f}}\n{eiocap:{\"enderio:block_simple_alloy_smelter/buffer\":2.222f}}\n... And the most specific way is to target a specific CapacitorKey by its name. Note: This list only contains some samples that may even be outdated. Please look up the availables names in the xml recipe files (e.g. capacitor.xml, capacitor_machines.xml)."
    },
    {
      "title": "arrows",
      "content": "Arrows There's an arrow correspoding to each potion|Potions added by Ender IO, but with 1/9 the duration. Arrow of Decay The Arrow of Decay applies the Withering Effect to the target(s). There are 2 types of the Arrow of Decay: The Normal Effect Type, which applies Withering for 5 seconds The Extended Effect Type, which applies Withering for 15 seconds Arrow of Rising The Arrow of Rising applies the Levitation Effect(the Vanilla effect applied by shulker shells) to the target(s). There are 3 types of the Arrow of Rising: The Normal Effect Type, which applies Levitation for 0 seconds The Extended Effect Type, which applies Levitation for 3 seconds The Enhaced Effect Type, which applies Levitation III for 0 seconds Arrow of Confusion The Arrow of Confusion applies the Nausea Effect(the Vanilla effect applied by eating Pufferfish) to the target(s). There are 2 types of the Arrow of Confusion: The Normal Effect Type, which applies Nausea for 5 seconds The Extended Effect Type, which applies Nausea for 15 seconds"
    },
    {
      "title": "attractor_obelisk",
      "content": "Entices mobs to walk towards it Specify the mobs to effect by placing their souls (in soul vials) within the device. Can be upgraded with capacitors to increase its range."
    },
    {
      "title": "aversion_obelisk",
      "content": "Prevents mobs from naturally spawning within its area of effect Specify the mobs to effect by placing their souls (in soul vials) within the device. Can be upgraded with capacitors to increase its range."
    },
    {
      "title": "basic_gear",
      "content": "Crafting Component The basic gear is used to craft machines."
    },
    {
      "title": "binder_composite",
      "content": "Crafting Component Binder Composite is made from sand, clay and gravel. It smelts into Conduit Binder."
    },
    {
      "title": "broken_spawner",
      "content": "Drops when breaking a mob spawner When combined with a Powered Spawner in an Anvil you'll get a Powered Spawner that can spawn the mob type of this broken spawner. You can change the type of a broken spawner with a Soul Vial in the Soul Binder."
    },
    {
      "title": "buffers",
      "content": "Item Buffer A block with a 9 stack inventory that can push/pull like a hopper in any direction. Power Buffer A block that holds and transfers power.  Can be configured to increase or decrease the amount transferred using the GUI.  Improving the Capacitor will improve it's buffer size and maximum transfer rate. Omni-Buffer A block that combines the functions of the power buffer and item buffer into a single block. Creative Buffer A creative version of the omni-buffer."
    },
    {
      "title": "capacitor_banks",
      "content": "Capacitor Banks Capacitor Banks store power.  Capacitor Banks of the same tier can connect into a free-form multiblock.  Each capacitor increases the total storage capacity, and the maximum transfer rate. The Capacitor Bank GUI can set the Max Input ( 2 ) and Max Output ( 3 ), can react to a redstone signal to enable/disable energy input ( 4 ) and output ( 5 ) separately, and it can set the IO ( 6 ).  By mousing over the power bar ( 1 ) you can see precise statistics relating to current power, maximum power, and current net power gain or loss. The functionality that made its GUI have slots to charge µI items and allow quick access to the Armor, off-hand, and Baubles slots was removed in 1.12! Use the Simple Wired Charger and the Wired Charger for that! Each side of a Capacitor Bank can be changed by shift + right clicking it with an empty hand, or by right clicking with a Yeta Wrench.  This can be used to show a power bar or screen with power input/output outside of the GUI. Basic Capacitor Bank Stores 1,000,000 µI and can transfer 1,000 µI/t. Capacitor Bank Stores 5,000,000 µI and can transfer 5,000 µI/t. Vibrant Capacitor Bank Stores 25,000,000 µI and can transfer 25,000 µI/t. Creative Capacitor Bank Normally not craftable.  Cannot form a multiblock.  Is permanently set to contain 2,500,000 µI out of 5,000,000 and is capable of transferring 500,000 µI.  Energy can either be inserted (voided) or extracted (infinite supply)."
    },
    {
      "title": "capacitors_endergy",
      "content": "Endergy Capacitors Endergy adds additional Capacitors. They behave exactly like the normal Capacitors. In order of the Global Level, the Capacitors are: Grainy Capacitor Global Level 1.0 Silver Capacitor Global Level 1.0 Endergetic Silver Capacitor Global Level 2.0 Endergised Capacitor Global Level 3.0 Crystalline Capacitor Global Level 3.5 Melodic Capacitor Global Level 4.0 Stellar Capacitor Global Level 5.0 Totemic Capacitor Can be enchanted with Efficiency, Unbreaking, and Mending. Global Level: No Efficiency: Global Level: 3.5 Efficiency 1: Global Level: 4.0 Efficiency 2: Global Level: 4.5 Efficiency 3: Global Level: 5.0 Efficiency 4: Global Level: 5.5 Efficiency 5: Global Level: 6.0 Total Uses: 512 If it is enchanted with Unbreaking , not every use will decrease the number of Uses Left . If it is enchanted with Mending , it can be repaired with XP, increasing the number of Uses Left ."
    },
    {
      "title": "capacitors",
      "content": "Capacitors Capacitors can be used to craft Capacitor Banks, Photovoltaic Cells, Dark Steel Upgrades and various other machines. Machines that have an upgrade slot require capacitors to function. Depending on their Global Level, Capacitors can increase the Speed, Range or Energy Storage of machines. Special capacitors with wildly varying properties can be found in loot chests. Basic Capacitor Global Level: 1 Double-Layer Capacitor Global Level: 2 Octadic Capacitor Global Level: 3"
    },
    {
      "title": "chassis_parts",
      "content": "Crafting component used to create block detectors and decorative blocks."
    },
    {
      "title": "clear_glass_and_fused_quartz",
      "content": "Clear Glass A glass alternative that connects to adjascent clear glass to form an almost textureless see through block option.  Enlightened variety also glows with a brightness of glowstone.  Dark variety blocks light from passing through. Fused Quartz Similar to Clear glass.  Also somewhat blast resistant.  Also comes in enlightened and dark varieties."
    },
    {
      "title": "coal_powder",
      "content": "Crafting Component Created by sagmilling|SAG Mill coal. Used to craft double-layer capacitors|Capacitor, Electrical Steel and Dark Steel."
    },
    {
      "title": "cold_fire_igniter",
      "content": "Allows to place Cold Fire Cold Fire will not spread to other blocks, will not burn items or entities, and will not cause Rocket Fuel to explode. Other mods may or may not recognize it as fire. The igniter needs to be fueled with Vapor of Levity."
    },
    {
      "title": "combustion_generator",
      "content": "Generates RF from liquid fuels.  Requires a fuel and a coolant.  The only available coolant in Ender IO is Water."
    },
    {
      "title": "conduit_binder",
      "content": "Crafting Component Conduit Binder is smelted from Binder Composite. It is used to craft Conduits|Conduit, Facades|Facade, Remote Awareness Upgrades|Remote Awareness Upgrade, Travel Anchors|Travel Anchor and \"Travel Anchor\" Decoration Blocks|Decoration Block."
    },
    {
      "title": "conduit_facades",
      "content": "Conduit Facade Facades, once painted in a painting machine, look like the block they were painted with, but can have conduits placed within them, allowing you to hide your conduits. Transparent Conduit Facade Regular facades do not hide conduits when the block it is painted with is smaller then the conduit bundle.  In this case a transparent conduit facade must be used instead. Hardened Conduit Facade & Transparent Hardened Conduit Facade Similar to conduit facades, these are also somewhat blast resistant."
    },
    {
      "title": "conduit_probe",
      "content": "Conduit Probe The Conduit Probe has 2 modes: In probe mode you can right-click an Energy Conduit|Energy Conduits to display details about its network, an Item Conduit to run a simulation of transporting the item in the other hand, or a Redstone Conduit to display information on its connections, including Redstone Level sent/received. In copy/paste mode you can shift-right-click to copy a conduit connection's settings and right-click to paste them. Use Shift-Mouse Wheel or 'Y' to change mode. The Conduit Probe is also used to craft Power Item Filters|Power Item Filter, Power Monitors and Energy Gauges|Energy Gauge."
    },
    {
      "title": "contributing_to_the_wiki",
      "content": "Sadly github does not allow us to give people permissions on the wiki without allowing them full access to everything. It also has no way of making PRs for wikis. But because wikis are also just git repos, we found a workaround. we do this: So fork https://github.com/HenryLoenwind/enderio-wiki and send PRs there."
    },
    {
      "title": "crafter",
      "content": ""
    },
    {
      "title": "crystals",
      "content": "Crystals"
    },
    {
      "title": "dark_axe",
      "content": "Dark Axe The Dark Axe is an axe added by Ender IO. It can be enchanted with any Axe Enchantments (Vanilla or Modded). Dark Steel Upgrades: Direct Teleports mined things into your inventory Empowered Empowered I Max Power: 100,000 µI Damage absorbed by power: 50% Empowered II Max Power: 150,000 µI Damage absorbed by power: 60% Empowered III Max Power: 250,000 µI Damage absorbed by power: 70% Empowered IV Max Power: 1,000,000 µI Damage absorbed by power: 85% Fork Who needs a hoe when you have a fork... Micro Anvil Allows editing upgrades of a single item in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Mini Anvil Allows editing upgrades of all equiped items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Pocket Anvil Provides full anvil functionality and allows editing upgrades of any items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that."
    },
    {
      "title": "dark_boots",
      "content": "Dark Boots The Dark Boots are boots added by Ender IO. They can be enchanted with any Boots Enchantments (Vanilla or Modded). When they are powered, they have extra Armor and Armor Toughness: Not Powered: + 2 Armor and + 1 Armor Toughness Powered: + 3 Armor and + 2 Armor Toughness Dark Steel Upgrades: Apiarist's Shoes (Forestry Integration) Protection against bees Empowered Empowered I Max Power: 100,000 µI Damage absorbed by power: 50% Empowered II Max Power: 150,000 µI Damage absorbed by power: 60% Empowered III Max Power: 250,000 µI Damage absorbed by power: 70% Empowered IV Max Power: 1,000,000 µI Damage absorbed by power: 85% Flippers Increases swimming speed Inventory Inventory I Adds an inventory to you armor The size = 6 slots Set the hotkey to open it in the game options Inventory II Increases the size of your armor's inventory The size = 12 slots Set the hotkey to open it in the game options Inventory III Increases the size of your armor's inventory The size = 18 slots Set the hotkey to open it in the game options Jump Jump I Increases step and jump height Jump II Increases step and jump height Allows double jumps Jump III Increases step and jump height Allows triple jumps Micro Anvil Allows editing upgrades of a single item in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Mini Anvil Allows editing upgrades of all equiped items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Pocket Anvil Provides full anvil functionality and allows editing upgrades of any items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Thaumaturge's Boots (Thaumcraft Integration) Vis Discount: 2%"
    },
    {
      "title": "dark_bow",
      "content": "Dark Bow The Dark Bow is a bow added by Ender IO. It can be enchanted with any Bow Enchantments (Vanilla or Modded). Its stats are very configurable in enderio.cfg: bow{ dark_bow { } }. It can be repaired in an Anvil using Nutritious Sticks. Dark Steel Upgrades: Empowered Empowered I Max Power: 100,000 µI Damage absorbed by power: 50% Empowered II Max Power: 150,000 µI Damage absorbed by power: 60% Empowered III Max Power: 250,000 µI Damage absorbed by power: 70% Empowered IV Max Power: 1,000,000 µI Damage absorbed by power: 85% Micro Anvil Allows editing upgrades of a single item in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Mini Anvil Allows editing upgrades of all equiped items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Pocket Anvil Provides full anvil functionality and allows editing upgrades of any items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that."
    },
    {
      "title": "dark_crook",
      "content": "Dark Crook One Click Deforestation. The Dark Axe is a crook added by Ender IO. It can be enchanted with any Crook Enchantments (Vanilla or Modded). It works exactly like the Ex Nihilo Crook (and is also compatible with it) and when empowered it will do AOE. Dark Steel Upgrades: Direct Teleports mined things into your inventory Empowered Empowered I Max Power: 100,000 µI Damage absorbed by power: 50% Empowered II Max Power: 150,000 µI Damage absorbed by power: 60% Empowered III Max Power: 250,000 µI Damage absorbed by power: 70% Empowered IV Max Power: 1,000,000 µI Damage absorbed by power: 85% Micro Anvil Allows editing upgrades of a single item in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Mini Anvil Allows editing upgrades of all equiped items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Pocket Anvil Provides full anvil functionality and allows editing upgrades of any items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Fork Who needs a hoe when you have a fork..."
    },
    {
      "title": "dark_helm",
      "content": "Dark Helm The Dark Helm is a helmet added by Ender IO. It can be enchanted with any Helmet Enchantments (Vanilla or Modded). When it is powered, it has extra Armor and Armor Toughness: Not Powered: + 2 Armor and + 1 Armor Toughness Powered: + 3 Armor and + 2 Armor Toughness Dark Steel Upgrades: Apiarist's Hat (Forestry Integration) Protection against bees Empowered Empowered I Max Power: 100,000 µI Damage absorbed by power: 50% Empowered II Max Power: 150,000 µI Damage absorbed by power: 60% Empowered III Max Power: 250,000 µI Damage absorbed by power: 70% Empowered IV Max Power: 1,000,000 µI Damage absorbed by power: 85% Inventory Inventory I Adds an inventory to you armor The size = 2 slots Set the hotkey to open it in the game options Inventory II Increases the size of your armor's inventory The size = 4 slots Set the hotkey to open it in the game options Inventory III Increases the size of your armor's inventory The size = 6 slots Set the hotkey to open it in the game options Micro Anvil Allows editing upgrades of a single item in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Mini Anvil Allows editing upgrades of all equiped items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Pocket Anvil Provides full anvil functionality and allows editing upgrades of any items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Naturalist's Eye (Forestry Integration) Shows pollinated tree leaves Night Vision Gives you the Night Vision Effect indefinitely(you can activate/deactivate it) Set the hotkey to activate/deactivate it in the game options Padding Muffles nearby sounds Revealing (Thaumcraft Integration) Vis Discount: 5% Solar Simple Solar Generates power from the sun Solar I Generates power from the sun Solar II Generates power from the sun Solar III Generates power from the sun Sound Locator Displays the location of nearby sounds The One Probe (The One Probe Integration) Adds TOP functionality to the Helmets"
    },
    {
      "title": "dark_iron_bars",
      "content": ""
    },
    {
      "title": "dark_leggings",
      "content": "Dark Leggings The Dark Leggings are leggings added by Ender IO. They can be enchanted with any Leggings Enchantments (Vanilla or Modded). When they are powered, they have extra Armor and Armor Toughness: Not Powered: + 5 Armor and + 1 Armor Toughness Powered: + 6 Armor and + 2 Armor Toughness Dark Steel Upgrades: Apiarist's Pants (Forestry Integration) Protection against bees Empowered Empowered I Max Power: 100,000 µI Damage absorbed by power: 50% Empowered II Max Power: 150,000 µI Damage absorbed by power: 60% Empowered III Max Power: 250,000 µI Damage absorbed by power: 70% Empowered IV Max Power: 1,000,000 µI Damage absorbed by power: 85% Inventory Inventory I Adds an inventory to you armor The size = 10 slots Set the hotkey to open it in the game options Inventory II Increases the size of your armor's inventory The size = 20 slots Set the hotkey to open it in the game options Inventory III Increases the size of your armor's inventory The size = 30 slots Set the hotkey to open it in the game options Micro Anvil Allows editing upgrades of a single item in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Mini Anvil Allows editing upgrades of all equiped items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Pocket Anvil Provides full anvil functionality and allows editing upgrades of any items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Speed Speed I Increases movement speed Speed II Increases movement speed Speed III Increases movement speed Thaumaturge's Leggings   (Thaumcraft Integration) Vis Discount: 3%"
    },
    {
      "title": "dark_paper_anvil",
      "content": "Dark Paper Anvil The Dark Paper Anvil is an anvil added by Ender IO. It is crafted using 7 pieces of Black Paper placed in an Anvil Shape It is Not Durable . It lasts much shorter than the Vanilla Anvil. It can be used to apply and remove upgrades. Working with Dark Steel Upgrades does not consume durability."
    },
    {
      "title": "dark_pick",
      "content": "Dark Pick The Dark Pick is a pickaxe added by Ender IO. It can be enchanted with any Pickaxe Enchantments (Vanilla or Modded). It has a Harvest Level = 5 (equivalent to a Cobalt Pickaxe), but it can be configured to have a Harvest Level = 3 (equivalent to a Diamond Pickaxe), by switching canMineTiCArdite = false in enderio.cfg. Dark Steel Upgrades: Carpeting Mining Range = Mining Volume + 1, if Depth is NOT present(See Explosive) Mining Range = Mining Volume - 1, if Depth is present(See Explosive) Flattens the explosive force into a carpet. Depth Mining Depth = Mining Volume + 1 (See Explosive) Directs the explosive force away from the player. Direct Teleports mined things into your inventory Empowered Empowered I Max Power: 100,000 µI Damage absorbed by power: 50% Empowered II Max Power: 150,000 µI Damage absorbed by power: 60% Empowered III Max Power: 250,000 µI Damage absorbed by power: 70% Empowered IV Max Power: 1,000,000 µI Damage absorbed by power: 85% Explosive Explosive I: Mining Volume = 1 Adds explosive power to the pickaxe, damaging surrounding blocks while mining. For problems that look like nails. Explosive II: Mining Volume = 2 Adds more explosive power to the pickaxe, damaging surrounding blocks while mining. For problems that look like nails. Explosive III: Mining Volume = 3 Adds even more explosive power to the pickaxe, damaging surrounding blocks while mining. For problems that look like nails. Explosive IV: Mining Volume = 4 Adds ridiculous explosive power to the pickaxe, damaging surrounding blocks while mining. For problems that look like combs. Explosive V: Mining Volume = 5 Adds ludicrous explosive power to the pickaxe, damaging surrounding blocks while mining. https://youtu.be/ygE01sOhzz0 Henry and tterrag want you to watch the full movie. \"You owe it to yourself\" - tterrag Micro Anvil Allows editing upgrades of a single item in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Mini Anvil Allows editing upgrades of all equiped items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Pocket Anvil Provides full anvil functionality and allows editing upgrades of any items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Spoon Who needs a shovel when you have a spoon... Travel Hold Shift and Right-Click to teleport or activate a travel anchor"
    },
    {
      "title": "dark_plate",
      "content": "Dark Plate The Dark Plate is a chestplate added by Ender IO. It can be enchanted with any Chestplate Enchantments (Vanilla or Modded). When it is powered, it has extra Armor and Armor Toughness: Not Powered: + 6 Armor and + 1 Armor Toughness Powered: + 8 Armor and + 2 Armor Toughness Dark Steel Upgrades: Apiarist's Shirt (Forestry Integration) Protection against bees Elytra Makes armor work as elytra (That means flying as if an Elytra was equipped, NOT \"creative\" flight!) Set the hotkey to activate/deactivate it in the game options Incompatible with Glider Empowered Empowered I Max Power: 100,000 µI Damage absorbed by power: 50% Empowered II Max Power: 150,000 µI Damage absorbed by power: 60% Empowered III Max Power: 250,000 µI Damage absorbed by power: 70% Empowered IV Max Power: 1,000,000 µI Damage absorbed by power: 85% Glider Enables Gliding Set the hotkey to activate/deactivate it in the game options Incompatible with Elytra Inventory Inventory I Adds an inventory to you armor The size = 18 slots Set the hotkey to open it in the game options Inventory II Increases the size of your armor's inventory The size = 36 slots Set the hotkey to open it in the game options Inventory III Increases the size of your armor's inventory The size = 54 slots Set the hotkey to open it in the game options Micro Anvil Allows editing upgrades of a single item in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Mini Anvil Allows editing upgrades of all equiped items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Pocket Anvil Provides full anvil functionality and allows editing upgrades of any items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Thaumaturge's Robe   (Thaumcraft Integration) Vis Discount: 3%"
    },
    {
      "title": "dark_shears",
      "content": "Dark Shears The Dark Shears are shears added by Ender IO. They can be enchanted with any Shears Enchantments (Vanilla or Modded). They can also break Tripwire without activating the Tripwire Hooks, just like the Vanilla Shears. Dark Steel Upgrades: Direct Teleports mined things into your inventory Empowered Empowered I Max Power: 100,000 µI Damage absorbed by power: 50% Empowered II Max Power: 150,000 µI Damage absorbed by power: 60% Empowered III Max Power: 250,000 µI Damage absorbed by power: 70% Empowered IV Max Power: 1,000,000 µI Damage absorbed by power: 85% Micro Anvil Allows editing upgrades of a single item in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Mini Anvil Allows editing upgrades of all equiped items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Pocket Anvil Provides full anvil functionality and allows editing upgrades of any items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that."
    },
    {
      "title": "dark_steel_anvil",
      "content": "Dark Steel Anvil The Dark Steel Anvil is an anvil added by Ender IO. It is Fall Damage Resistant . It lasts much longer than the Vanilla Anvil. It can be used to apply and remove upgrades. Working with Dark Steel Upgrades does not consume durability."
    },
    {
      "title": "dark_steel_ladder",
      "content": "Dark Steel Ladder The Dark Steel Ladder is a ladder added by Ender IO. It is Faster than Regular (Vanilla) Ladders ."
    },
    {
      "title": "dark_steel_trapdoor",
      "content": "Dark Steel Trapdoor The Dark Steel Trapdoor is a trapdoor added by Ender IO. It can only be opened by Redstone Signal. It is Blast Resistant ."
    },
    {
      "title": "dark_steel_upgrades",
      "content": "Dark Steel Upgrades Ender IO adds multiple Dark Steel Upgrades that can be applied in a Dark Steel Anvil, Dark Paper Anvil or Dark/Ender/Stellar item with an Anvil Upgrade to Dark, Ender, and Stellar Weapons, Tools, and Armor. For a Player guide on how to use the Dark Steel Upgrade system, see Guide: Dark Steel Upgrades|Guide Dark Steel Upgrades. For a Pack Author/Server Admin guide to disabling upgrades, see Disabling Upgrades. Blank Dark Steel Upgrade Made in the Alloy Smelter with Dark Iron Bars, Clay, and 4 pieces of String Cannot be applied to anything Used to make all the other Dark Steel Upgrades Dark Steel Upgrade \"Micro Anvil\" Crafted with a Blank Upgrade, 2 Sticks, and 2 Dark Steel Nuggets Upgrade for Dark Steel Items Allows editing upgrades of a single item in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Can be applied to: Any Dark Steel Item 1 level needed to activate this upgrade (Activate this item by right-clicking) Dark Steel Upgrade \"Mini Anvil\" Crafted with a Blank Upgrade, 2 Sticks, and 2 Dark Steel Ingots Upgrade for Dark Steel Items Allows editing upgrades of all equiped items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Depends on: Micro Anvil Can be applied to: Any Dark Steel Item 2 levels needed to activate this upgrade (Activate this item by right-clicking) Dark Steel Upgrade \"Pocket Anvil\" Crafted with a Blank Upgrade, a Dark Steel Anvil, 2 Sticks, and a Dark Steel Block Upgrade for Dark Steel Items Provides full anvil functionality and allows editing upgrades of any items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Depends on: Mini Anvil Can be applied to: Any Dark Steel Item 4 levels needed to activate this upgrade (Activate this item by right-clicking) Dark Steel Upgrade \"Carpeting\" Crafted with a Blank Upgrade and a Carpet Upgrade for Dark Steel Items Flatens the explosive force into a carpet. Depends on: Explosive I Can be applied to: Dark, Ender and Stellar Pickaxes 8 levels needed to activate this upgrade (Activate this item by right-clicking) Dark Steel Upgrade \"Depth\" Crafted with a Blank Upgrade and a Creeper Head Upgrade for Dark Steel Items Directs the explosive force away from the player. Depends on: Explosive I Can be applied to: Dark, Ender, and Stellar Pickaxes 8 levels needed to activate this upgrade (Activate this item by right-clicking) Dark Steel Upgrade \"Direct\" Crafted with a Blank Upgrade, an Ender Pearl, 3 Vibrant Alloy Ingots, and 4 Vibrant Alloy Nuggets Upgrade for Dark Steel Items Teleports mined things directly into your inventory Depends on: Empowered Can be applied to: Dark, Ender, and Stellar Weapons Dark, Ender, and Stellar Tools 8 levels needed to activate this upgrade (Activate this item by right-clicking) Dark Steel Upgrade \"Elytra\" Crafted with a Blank Upgrade and an Elytra Upgrade for Dark Steel Items Makes armor work as elytra (That means flying as if an Elytra was equipped, NOT \"creative\" flight!) Set the hotkey to activate/deactivate it in the game options Incompatible with Glider Can be applied to: Dark, Ender, and Stellar Chestplates 10 levels needed to activate this upgrade (Activate this item by right-clicking) Dark Steel Upgrade \"Empowered\" There are 5 levels of Empowered: Empowered I: Crafted with a Blank Upgrade and a Vibrant Crystal Empowered II: Crafted with a Blank Upgrade and a Basic Capacitor Empowered III: Crafted with a Blank Upgrade and a Double-Layer Capacitor Empowered IV: Crafted with a Blank Upgrade and an Octadic Capacitor Empowered V: Crafted with a Blank Upgrade and a Tormented Enderman Head Upgrade for Dark Steel Items Empowered II-V depend on the previous level Can be applied to: Any Dark, Ender or Stellar Item (Empowered I-IV) Any Ender or Stellar Item ( Empowered V ) Needed levels to activate these upgrades Empowered I: 4 levels Empowered II: 8 levels Empowered III: 12 levels Empowered IV: 16 levels Empowered V: 20 levels (Activate these items by right-clicking) Dark Steel Upgrade \"Glider\" Crafted with a Blank Upgrade and Glider Wings Upgrade for Dark Steel Items Enables Gliding Set the hotkey to activate/deactivate it in the game options Incompatible with Elytra Can be applied to: Dark, Ender, and Stellar Chestplates 4 levels needed to activate this upgrade (Activate this item by right-clicking) Dark Steel Upgrade \"Fork\" Crafted with a Blank Upgrade and a Diamond Hoe Upgrade for Dark Steel Items Who needs a hoe when you have a fork... Depends on: Empowered Can be applied to: Dark, Ender, and Stellar Axes Dark Crooks 4 levels needed to activate this upgrade (Activate this item by right-clicking) Dark Steel Upgrade \"Inventory\" There are 3 levels of Inventory: Inventory I: Crafted with a Blank Upgrade, a Chest, and a Wooden Gear Inventory II: Crafted with a Blank Upgrade, a Chest, and an Energized Bimetal Gear Inventory III: Crafted with a Blank Upgrade, a Chest, and a Vibrant Bimetal Gear Upgrade for Dark Steel Items Inventory I Adds an inventory to you armor The size depends on the armor type Set the hotkey to open it in the game options Inventory II-III Increase the size of your armor's inventory Set the hotkey to open it in the game options Depends on: Empowered Inventory II-III depend on the previous level Can be applied to: Dark, Ender, and Stellar Armor Pieces Needed levels to activate these upgrades Inventory I: 12 levels Inventory II: 20 levels Inventory III: 32 levels (Activate these items by right-clicking) Dark Steel Upgrade \"Jump\" There are 3 levels of Jump: Jump I: Crafted with a Blank Upgrade, a Piston, and a Wooden Gear Jump II: Crafted with a Blank Upgrade, a Piston, and an Energized Bimetal Gear Jump III: Crafted with a Blank Upgrade, a Piston, and a Vibrant Bimetal Gear Upgrade for Dark Steel Items Increases step and jump height Jump II allows double jumps Jump III allows triple jumps Set the hotkey to activate/deactivate it in the game options Depends on: Empowered Jump II-III depend on the previous level Can be applied to: Dark, Ender, and Stellar Boots Needed levels to activate these upgrades Jump I: 4 levels Jump II: 6 levels Jump III: 8 levels (Activate these items by right-clicking) Dark Steel Upgrade \"Night Vision\" Crafted with a Blank Upgrade and a Potion of Night Vision Upgrade for Dark Steel Items Gives you the Night Vision Effect indefinitely(you can activate/deactivate it) Set the hotkey to activate/deactivate it in the game options Can be applied to: Dark, Ender, and Stellar Helmets 4 levels needed to activate this upgrade (Activate this item by right-clicking) Dark Steel Upgrade \"Padding\" Crafted with a Blank Upgrade and a piece of Wool Upgrade for Dark Steel Items Muffles nearby sound Can be applied to: Dark, Ender, and Stellar Helmets 4 levels needed to activate this upgrade (Activate this item by right-clicking) Dark Steel Upgrade \"Solar\" There are 4 levels of Solar: Simple Solar: Crafted with a Blank Upgrade and a Simple Photovoltaic Cell Solar I: Crafted with a Blank Upgrade and a Photovoltaic Cell Solar II: Crafted with a Blank Upgrade and an Advanced Photovoltaic Cell Solar III: Crafted with a Blank Upgrade and a Vibrant Photovoltaic Cell Upgrade for Dark Steel Items Generates power from the sun Depends on: Empowered Solar I-III depend on the previous level Can be applied to: Dark, Ender, and Stellar Helmets Needed levels to activate these upgrades Simple Solar: 4 levels Solar I: 8 levels Solar II: 16 levels Solar III: 24 levels (Activate these items by right-clicking) Dark Steel Upgrade \"Sound Locator\" Crafted with a Blank Upgrade and a Note Block Upgrade for Dark Steel Items Displays the Location of nearby sounds nearby sound Set the hotkey to activate/deactivate it in the game options Can be applied to: Dark, Ender, and Stellar Helmets 4 levels needed to activate this upgrade (Activate this item by right-clicking) Dark Steel Upgrade \"Speed\" There are 3 levels of Speed: Speed I: Crafted with a Blank Upgrade, a Potion of Swiftness, and a Wooden Gear Speed II: Crafted with a Blank Upgrade, a Potion of Swiftness, and an Energized Bimetal Gear Speed III: Crafted with a Blank Upgrade, a Potion of Swiftness, and a Vibrant Bimetal Gear Upgrade for Dark Steel Items Increases movement speed Set the hotkey to activate/deactivate it in the game options Depends on: Empowered Speed II-III depend on the previous level Can be applied to: Dark, Ender, and Stellar Leggings Needed levels to activate these upgrades Speed I: 4 levels Speed II: 6 levels Speed III: 8 levels (Activate these items by right-clicking) Dark Steel Upgrade \"Spoon\" Crafted with a Blank Upgrade and a Diamond Shovel Upgrade for Dark Steel Items Who needs a shovel when you have a spoon... Depends on: Empowered Can be applied to: Dark, Ender, and Stellar Pickaxes 4 levels needed to activate this upgrade (Activate this item by right-clicking) Dark Steel Upgrade \"Step Assist\" Crafted with a Blank Upgrade and 5 Bricks Upgrade for Dark Steel Items Allows you to walk up blocks as if they were stairs. Depends on: Empowered Jump Can be applied to: Dark, Ender, and Stellar Boots 2 levels needed to activate this upgrade (Activate this item by right-clicking) Dark Steel Upgrade \"Flippers\" Crafted with a Blank Upgrade and a Lily Pad Upgrade for Dark Steel Items Increases swimming speed Can be applied to: Dark, Ender, and Stellar Boots 4 levels needed to activate this upgrade (Activate this item by right-clicking) Dark Steel Upgrade \"Explosive\" There are 5 levels of Explosive: Explosive I: Crafted with a Blank Upgrade, a piece of TNT, and a Wooden Gear Explosive II: Crafted with a Blank Upgrade, a piece of TNT, and a Stone Compound Gear Explosive III: Crafted with a Blank Upgrade, a piece of TNT, and an Infinity Bimetal Gear Explosive IV: Crafted with a Blank Upgrade, a piece of TNT, and an Energized Bimetal Gear Explosive V: Crafted with a Blank Upgrade, a piece of TNT, and a Vibrant Bimetal Gear Upgrade for Dark Steel Items Explosive I: Adds explosive power to the pickaxe, damaging surrounding blocks while mining. For problems that look like nails. Explosive II: Adds more explosive power to the pickaxe, damaging surrounding blocks while mining. For problems that look like nails. Explosive III: Adds even more explosive power to the pickaxe, damaging surrounding blocks while mining. For problems that look like nails. Explosive IV: Adds ridiculous explosive power to the pickaxe, damaging surrounding blocks while mining. For problems that look like combs. Explosive V: Adds ludicrous explosive power to the pickaxe, damaging surrounding blocks while mining. Space Balls - Ludicrous Speed Henry and tterrag want you to watch the full movie. \"You owe it to yourself\" - tterrag Depends on: Empowered Can be applied to: Dark, Ender, and Stellar Pickaxes Needed levels to activate these upgrades Explosive I: 8 levels Explosive II: 12 levels Explosive III: 18 levels Explosive IV: 26 levels Explosive V: 36 levels (Activate these items by right-clicking) Dark Steel Upgrade \"Travel\" Crafted with a Blank Upgrade and an Ender Crystal Upgrade for Dark Steel Items Hold Shift and Right-Click to teleport or activate a travel anchor Depends on: Empowered Can be applied to: Dark, Ender, and Stellar Swords Dark, Ender, and Stellar Pickaxes 16 levels needed to activate this upgrade (Activate this item by right-clicking) The One Probe Integration Dark Steel Upgrade \"The One Probe\" Crafted with a Blank Upgrade and (TOP)The One Probe Upgrade for Dark Steel Items Adds TOP functionality to the Helmets Can be applied to: Dark, Ender, and Stellar Helmets 4 levels needed to activate this upgrade (Activate this item by right-clicking) Forestry Integration Dark Steel Upgrade \"Naturalist's Eye\" Crafted with a Blank Upgrade and (Forestry)Spectacles Upgrade for Dark Steel Items Shows pollinated tree leaves Can be applied to: Dark, Ender, and Stellar Helmets 4 levels needed to activate this upgrade (Activate this item by right-clicking) Dark Steel Upgrades \"Apiarist's Clothes/Armor\" There are 4 upgrades corresponding to the 4 pieces: Apiarist's Hat: Crafted with a Blank Upgrade and the Apiarist's Hat Apiarist's Shirt: Crafted with a Blank Upgrade and the Apiarist's Shirt Apiarist's Pants: Crafted with a Blank Upgrade and the Apiarist's Pants Apiarist's Shoes: Crafted with a Blank Upgrade and the Apiarist's Shoes Upgrades for Dark Steel Items Protection against bees Can be applied to: Dark, Ender, and Stellar Helmets (Apiarist's Hat) Dark, Ender, and Stellar Chestplates (Apiarist's Shirt) Dark, Ender, and Stellar Leggings (Apiarist's Pants) Dark, Ender, and Stellar Boots (Apiarist's Shoes) 4 levels needed to activate these upgrades (Activate these items by right-clicking) Thaumcraft Integration Dark Steel Upgrade \"Revealing\" Crafted with a Blank Upgrade and the (Thaumcraft)Goggles of Revealing Upgrade for Dark Steel Items Vis Discount 5% Can be applied to: Dark, Ender, and Stellar Helmets 4 levels needed to activate this upgrade (Activate this item by right-clicking) Dark Steel Upgrade \"Thaumaturge's Robe\" Crafted with a Blank Upgrade and the (Thaumcraft)Thaumaturge's Robe Upgrade for Dark Steel Items Vis Discount 3% Can be applied to: Dark, Ender, and Stellar Chestplates 4 levels needed to activate this upgrade (Activate this item by right-clicking) Dark Steel Upgrade \"Thaumaturge's Leggings\" Crafted with a Blank Upgrade and the (Thaumcraft)Thaumaturge's Leggings Upgrade for Dark Steel Items Vis Discount 3% Can be applied to: Dark, Ender, and Stellar Leggings 4 levels needed to activate this upgrade (Activate this item by right-clicking) Dark Steel Upgrade \"Thaumaturge's Boots\" Crafted with a Blank Upgrade and the (Thaumcraft)Thaumaturge's Boots Upgrade for Dark Steel Items Vis Discount 2% Can be applied to: Dark, Ender, and Stellar Boots 4 levels needed to activate this upgrade (Activate this item by right-clicking)"
    },
    {
      "title": "dark_treetap",
      "content": "Dark Treetap The Dark Treetap is a treetap added by Ender IO. It can be enchanted with any Treetap Enchantments (Vanilla or Modded). It extracts Resin from Rubber Trees, just like the IC2 treetap, but with one big difference: Farming Station Use Only Dark Steel Upgrades: Empowered Empowered I Max Power: 100,000 µI Damage absorbed by power: 50% Empowered II Max Power: 150,000 µI Damage absorbed by power: 60% Empowered III Max Power: 250,000 µI Damage absorbed by power: 70% Empowered IV Max Power: 1,000,000 µI Damage absorbed by power: 85% Micro Anvil Allows editing upgrades of a single item in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Mini Anvil Allows editing upgrades of all equiped items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Pocket Anvil Provides full anvil functionality and allows editing upgrades of any items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that."
    },
    {
      "title": "decoration_blocks",
      "content": ""
    },
    {
      "title": "dimensional_transceiver",
      "content": ""
    },
    {
      "title": "disabling_upgrades",
      "content": "Disabling Dark Steel Upgrades Disabling Dark Steel Upgrades can be done in 2 ways: 1. By editing the enderio.cfg file in the config/enderio folder. To edit this file, do the following:\n* Open the file with an editor (eg. VS Code, Sublime Text, Notepad++, even Notepad)\n* Press CTRL+F (or the key combination which enables you to search text in a file)\n* Enter: upgrades * Go to the line: S:disabled= * Add the IDs of the upgrades you wish to disable after the = , separated by a , .\n  - You can enter any upgrade's ID here. It doesn't matter if the upgrade is for armor, tools or weapons.\n  - Example: To disable the Elytra Upgrade and the Flippers Upgrade, the line has to be: S:disabled=enderio:elytra,enderio:swim .\n* Save the file (Ctrl+S) ID table: 2. By removing the crafting recipe for a Dark Steel Upgrade This method doesn't disable Upgrades completely. This method has less chance of having unintended side effects. The one downside is that upgrade items will still be generated as (and on) dungeon loot. Only disabling the upgrades as shown above (or disabling the dungeon loot completely) will prevent that. To disable the dungeon loot, follow this link: Disabling Dungeon Loot To disable a DSU recipe, do the following:\n* Copy the file config/enderio/recipes/darksteel_upgrades.xml to config/enderio/recipes/user * Find the recipe you want to disable\n* Add disabled=\"true\" inside the <recipe> tag\n  - Example: To disable the Elytra Upgrade recipe, the Elytra Upgrade <recipe> should look like this: xml\n    <recipe required=\"true\" name=\"Dark Steel Upgrade: Elytra\" disabled=\"true\">\n      <dependency upgrade=\"enderio:elytra\"/>\n      <crafting>\n        <shapeless>\n          <item name=\"enderio:item_dark_steel_upgrade:0\"/><item name=\"minecraft:elytra\"/>\n        </shapeless>\n        <output name=\"enderio:item_dark_steel_upgrade:1\" nbt='{\"enderio:dsu\":\"enderio:elytra\"}'/>\n      </crafting>\n    </recipe> * Save the file (Ctrl+S)"
    },
    {
      "title": "electromagnet",
      "content": ""
    },
    {
      "title": "enchanter",
      "content": ""
    },
    {
      "title": "enchantments",
      "content": "Enchantments Ender IO adds 5 different enchantments. They are made in the Enchanter. Repellent Has 4 Levels Chance to teleport attackers away Higher levels teleport more often and farther Decay Applies withering to the target Applies to melee weapons Soulbound Prevents item from being lost on death Note: Most gravestone mods are stupid and prevent this from working! Withering Applies withering to the target Applies to bows Shimmer Makes the item shimmer as if it was enchanted. That's all. Really. Nothing more. Yes, it is useless. I know."
    },
    {
      "title": "ender_axe",
      "content": "Ender Axe The Ender Axe is an axe added by Ender IO. It can be enchanted with any Axe Enchantments (Vanilla or Modded). Dark Steel Upgrades: Direct Teleports mined things into your inventory Empowered Empowered I Max Power: 100,000 µI Damage absorbed by power: 50% Empowered II Max Power: 150,000 µI Damage absorbed by power: 60% Empowered III Max Power: 250,000 µI Damage absorbed by power: 70% Empowered IV Max Power: 1,000,000 µI Damage absorbed by power: 85% Empowered V Max Power: 2,500,000 µI Damage absorbed by power: 95% Fork Who needs a hoe when you have a fork... Micro Anvil Allows editing upgrades of a single item in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Mini Anvil Allows editing upgrades of all equiped items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Pocket Anvil Provides full anvil functionality and allows editing upgrades of any items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that."
    },
    {
      "title": "ender_boots",
      "content": "Ender Boots The Ender Boots are boots added by Ender IO. They can be enchanted with any Boots Enchantments (Vanilla or Modded). When they are powered, they have extra Armor and Armor Toughness: Not Powered: + 4 Armor and + 3 Armor Toughness Powered: + 5 Armor and + 4 Armor Toughness Dark Steel Upgrades: Apiarist's Shoes (Forestry Integration) Protection against bees Empowered Empowered I Max Power: 100,000 µI Damage absorbed by power: 50% Empowered II Max Power: 150,000 µI Damage absorbed by power: 60% Empowered III Max Power: 250,000 µI Damage absorbed by power: 70% Empowered IV Max Power: 1,000,000 µI Damage absorbed by power: 85% Empowered V Max Power: 2,500,000 µI Damage absorbed by power: 95% Flippers Increases swimming speed Inventory Inventory I Adds an inventory to you armor The size = 6 slots Set the hotkey to open it in the game options Inventory II Increases the size of your armor's inventory The size = 12 slots Set the hotkey to open it in the game options Inventory III Increases the size of your armor's inventory The size = 18 slots Set the hotkey to open it in the game options Jump Jump I Increases step and jump height Jump II Increases step and jump height Allows double jumps Jump III Increases step and jump height Allows triple jumps Micro Anvil Allows editing upgrades of a single item in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Mini Anvil Allows editing upgrades of all equiped items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Pocket Anvil Provides full anvil functionality and allows editing upgrades of any items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Thaumaturge's Boots (Thaumcraft Integration) Vis Discount: 2%"
    },
    {
      "title": "ender_bow",
      "content": "Ender Bow The Ender Bow is a bow added by Ender IO. It can be enchanted with any Bow Enchantments (Vanilla or Modded). Its stats are very configurable in enderio.cfg: bow{ end_bow { } }. It can be repaired in an Anvil using Infinity Rods. Dark Steel Upgrades: Empowered Empowered I Max Power: 100,000 µI Damage absorbed by power: 50% Empowered II Max Power: 150,000 µI Damage absorbed by power: 60% Empowered III Max Power: 250,000 µI Damage absorbed by power: 70% Empowered IV Max Power: 1,000,000 µI Damage absorbed by power: 85% Empowered V Max Power: 2,500,000 µI Damage absorbed by power: 95% Micro Anvil Allows editing upgrades of a single item in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Mini Anvil Allows editing upgrades of all equiped items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Pocket Anvil Provides full anvil functionality and allows editing upgrades of any items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that."
    },
    {
      "title": "ender_helm",
      "content": "Ender Helm The Ender Helm is a helmet added by Ender IO. It can be enchanted with any Helmet Enchantments (Vanilla or Modded). When it is powered, it has extra Armor and Armor Toughness: Not Powered: + 4 Armor and + 3 Armor Toughness Powered: + 5 Armor and + 4 Armor Toughness Dark Steel Upgrades: Apiarist's Hat (Forestry Integration) Protection against bees Empowered Empowered I Max Power: 100,000 µI Damage absorbed by power: 50% Empowered II Max Power: 150,000 µI Damage absorbed by power: 60% Empowered III Max Power: 250,000 µI Damage absorbed by power: 70% Empowered IV Max Power: 1,000,000 µI Damage absorbed by power: 85% Empowered V Max Power: 2,500,000 µI Damage absorbed by power: 95% Inventory Inventory I Adds an inventory to you armor The size = 2 slots Set the hotkey to open it in the game options Inventory II Increases the size of your armor's inventory The size = 4 slots Set the hotkey to open it in the game options Inventory III Increases the size of your armor's inventory The size = 6 slots Set the hotkey to open it in the game options Micro Anvil Allows editing upgrades of a single item in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Mini Anvil Allows editing upgrades of all equiped items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Pocket Anvil Provides full anvil functionality and allows editing upgrades of any items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Naturalist's Eye (Forestry Integration) Shows pollinated tree leaves Night Vision Gives you the Night Vision Effect indefinitely(you can activate/deactivate it) Set the hotkey to activate/deactivate it in the game options Padding Muffles nearby sounds Revealing (Thaumcraft Integration) Vis Discount: 5% Solar Simple Solar Generates power from the sun Solar I Generates power from the sun Solar II Generates power from the sun Solar III Generates power from the sun Sound Locator Displays the location of nearby sounds The One Probe (The One Probe Integration) Adds TOP functionality to the Helmets"
    },
    {
      "title": "ender_leggings",
      "content": "Ender Leggings The Ender Leggings are leggings added by Ender IO. They can be enchanted with any Leggings Enchantments (Vanilla or Modded). When they are powered, they have extra Armor and Armor Toughness: Not Powered: + 7 Armor and + 3 Armor Toughness Powered: + 8 Armor and + 4 Armor Toughness Dark Steel Upgrades: Apiarist's Pants (Forestry Integration) Protection against bees Empowered Empowered I Max Power: 100,000 µI Damage absorbed by power: 50% Empowered II Max Power: 150,000 µI Damage absorbed by power: 60% Empowered III Max Power: 250,000 µI Damage absorbed by power: 70% Empowered IV Max Power: 1,000,000 µI Damage absorbed by power: 85% Empowered V Max Power: 2,500,000 µI Damage absorbed by power: 95% Inventory Inventory I Adds an inventory to you armor The size = 10 slots Set the hotkey to open it in the game options Inventory II Increases the size of your armor's inventory The size = 20 slots Set the hotkey to open it in the game options Inventory III Increases the size of your armor's inventory The size = 30 slots Set the hotkey to open it in the game options Micro Anvil Allows editing upgrades of a single item in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Mini Anvil Allows editing upgrades of all equiped items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Pocket Anvil Provides full anvil functionality and allows editing upgrades of any items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Speed Speed I Increases movement speed Speed II Increases movement speed Speed III Increases movement speed Thaumaturge's Leggings   (Thaumcraft Integration) Vis Discount: 3%"
    },
    {
      "title": "ender_pickaxe",
      "content": "Ender Pickaxe The Ender Pickaxe is a pickaxe added by Ender IO. It can be enchanted with any Pickaxe Enchantments (Vanilla or Modded). It has a Harvest Level = 5 (equivalent to a Cobalt Pickaxe), but it can be configured to have a Harvest Level = 3 (equivalent to a Diamond Pickaxe), by switching canMineTiCArdite = false in enderio.cfg. Dark Steel Upgrades: Carpeting Mining Range = Mining Volume + 1, if Depth is NOT present(See Explosive) Mining Range = Mining Volume - 1, if Depth is present(See Explosive) Flattens the explosive force into a carpet. Depth Mining Depth = Mining Volume + 1 (See Explosive) Directs the explosive force away from the player. Direct Teleports mined things into your inventory Empowered Empowered I Max Power: 100,000 µI Damage absorbed by power: 50% Empowered II Max Power: 150,000 µI Damage absorbed by power: 60% Empowered III Max Power: 250,000 µI Damage absorbed by power: 70% Empowered IV Max Power: 1,000,000 µI Damage absorbed by power: 85% Empowered V Max Power: 2,500,000 µI Damage absorbed by power: 95% Explosive Explosive I: Mining Volume = 1 Adds explosive power to the pickaxe, damaging surrounding blocks while mining. For problems that look like nails. Explosive II: Mining Volume = 2 Adds more explosive power to the pickaxe, damaging surrounding blocks while mining. For problems that look like nails. Explosive III: Mining Volume = 3 Adds even more explosive power to the pickaxe, damaging surrounding blocks while mining. For problems that look like nails. Explosive IV: Mining Volume = 4 Adds ridiculous explosive power to the pickaxe, damaging surrounding blocks while mining. For problems that look like combs. Explosive V: Mining Volume = 5 Adds ludicrous explosive power to the pickaxe, damaging surrounding blocks while mining. https://youtu.be/ygE01sOhzz0 Henry and tterrag want you to watch the full movie. \"You owe it to yourself\" - tterrag Micro Anvil Allows editing upgrades of a single item in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Mini Anvil Allows editing upgrades of all equiped items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Pocket Anvil Provides full anvil functionality and allows editing upgrades of any items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Spoon Who needs a shovel when you have a spoon... Travel Hold Shift and Right-Click to teleport or activate a travel anchor"
    },
    {
      "title": "ender_plate",
      "content": "Ender Plate The Ender Plate is a chestplate added by Ender IO. It can be enchanted with any Chestplate Enchantments (Vanilla or Modded). When it is powered, it has extra Armor and Armor Toughness: Not Powered: + 10 Armor and + 3 Armor Toughness Powered: + 12 Armor and + 4 Armor Toughness Dark Steel Upgrades: Apiarist's Shirt (Forestry Integration) Protection against bees Elytra Makes armor work as elytra (That means flying as if an Elytra was equipped, NOT \"creative\" flight!) Set the hotkey to activate/deactivate it in the game options Incompatible with Glider Empowered Empowered I Max Power: 100,000 µI Damage absorbed by power: 50% Empowered II Max Power: 150,000 µI Damage absorbed by power: 60% Empowered III Max Power: 250,000 µI Damage absorbed by power: 70% Empowered IV Max Power: 1,000,000 µI Damage absorbed by power: 85% Empowered V Max Power: 2,500,000 µI Damage absorbed by power: 95% Glider Enables Gliding Set the hotkey to activate/deactivate it in the game options Incompatible with Elytra Inventory Inventory I Adds an inventory to you armor The size = 18 slots Set the hotkey to open it in the game options Inventory II Increases the size of your armor's inventory The size = 36 slots Set the hotkey to open it in the game options Inventory III Increases the size of your armor's inventory The size = 54 slots Set the hotkey to open it in the game options Micro Anvil Allows editing upgrades of a single item in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Mini Anvil Allows editing upgrades of all equiped items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Pocket Anvil Provides full anvil functionality and allows editing upgrades of any items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Thaumaturge's Robe   (Thaumcraft Integration) Vis Discount: 3%"
    },
    {
      "title": "ender_resonator",
      "content": ""
    },
    {
      "title": "enderios",
      "content": "Part of a balanced breakfast! Not actually healthy. Contains 253g of sugar, 53g of fat, and 394g of ender dust. Side effects of ender dust include: nausea, dizziness, confusion, and random teleporting."
    },
    {
      "title": "enderman_head",
      "content": ""
    },
    {
      "title": "energy_(µi)",
      "content": "Ender IO's unit of Energy is called a Micro Infinity, and is annotated by µI. In practice, Ender IO uses the Forge Energy (FE) API; Micro Infinity is another label for it, similar to Actually Addition's Crystal Flux and Immersive Engineering's Immersive Flux. In general, Forge Energy converts 1:1 with both the CoFH RF and Tesla APIs, but the power conversion has to be done using another mod.  Note that the CoFH mods (the Thermal series) handle the RF <-> FE themselves and encourages other RF mods to do so as well."
    },
    {
      "title": "energy_conduits_endergy",
      "content": "Endergy Energy Conduits Endergy adds additional Energy Conduits. They behave exactly like the normal Energy Conduits. Crude Energy Conduit It has a Max Output of 20 µI/t. Iron Energy Conduit It has a Max Output of 40 µI/t. Aluminum Energy Conduit It has a Max Output of 80 µI/t. Gold Energy Conduit It has a Max Output of 160 µI/t. Copper Energy Conduit It has a Max Output of 320 µI/t. Silver Energy Conduit It has a Max Output of 1,280 µI/t. Electrum Energy Conduit It has a Max Output of 2,560 µI/t. Energetic Silver Energy Conduit It has a Max Output of 10,240 µI/t. Crystalline Energy Conduit It has a Max Output of 40,960 µI/t. Crystalline Pink Slime Energy Conduit It has a Max Output of 81,920 µI/t. Melodic Energy Conduit It has a Max Output of 327,680 µI/t. Stellar Energy Conduit It has a Max Output of 2,000,000,000 µI/t."
    },
    {
      "title": "energy_conduits",
      "content": "Energy Conduits The Energy Conduits transfer µI between capacitor banks/machines. There are 3 types of Energy Conduits: Energy Conduit This is the first tier. It has a Max Output of 640 µI/t. Enhanced Energy Conduit This is the second tier. It has a Max Output of 5,120 µI/t. Ender Energy Conduit This is the third tier. It has a Max Output of 20,480 µI/t. The GUI of all Energy conduits is split between their 2 modes: insert and extract . These modes can be toggled independently. Insert Insertion has no additional settings. Extract Redstone Mode ( 1 ) Controls when the extraction should happen in regards to Redstone Signal . It can be set to these modes: Always active Extraction is always active, ignoring redstone signal. Active with signal Extraction only happens if the conduit receives a redstone signal(power 1-15). If the redstone signal is transmitted by a redstone conduit, the Signal Color can be set. Active without signal Extraction only happens if the conduit doesn't receive a redstone signal(power 0). If the redstone signal is transmitted by a redstone conduit, the Signal Color can be set. Never active Extraction is never active, ignoring redstone signal."
    },
    {
      "title": "energy_gauge",
      "content": "Energy Gauge Displays energy levels of adjacent blocks When placed besides a block that has a supported energy storage, it will display a gauge with that blocks buffer levels on the block. It can do that on all 4 sides."
    },
    {
      "title": "exit_rail",
      "content": "A rail that will break minecarts that are either empty or carrying a player or mob.  Other minecart variants are slowed down."
    },
    {
      "title": "experience_obelisk",
      "content": ""
    },
    {
      "title": "experience_rod",
      "content": ""
    },
    {
      "title": "farming_station",
      "content": ""
    },
    {
      "title": "filters",
      "content": "Filters Filters can be added to conduit connections to control what the conduit can insert or extract.\nThey can be configured when installed (gear button) or by right-clicking them into the air. Item Filters Fluid Filters Redstone Filters"
    },
    {
      "title": "fluid_conduits",
      "content": "Fluid Conduits The Fluid Conduits transfer fluids between tanks. There are 3 types of Fluid Conduits: Fluid Conduit This is the first tier. It has a Max Extract Speed of 50 mB/t. It has Max IO: Speed of 200 mB/t. It has configurable Redstone Mode. Its Fluid Flow Respects Gravity! Its Flow Rate is dependent on Fluid Viscosity! It can be filtered to a specific fluid by right-clicking the conduit with a bucket. Pressurized Fluid Conduit This is the second tier. It has a Max Extract Speed of 100 mB/t. It has Max IO Speed of 400 mB/t. It has configurable Redstone Mode. It can be filtered to a specific fluid by right-clicking the conduit with a bucket. Ender Fluid Conduit This is the third tier. It has a Max Extract Speed of 200 mB/t. It has Max IO Speed of 800 mB/t. It instantly teleports fluids between the conduit bundles(connections with tanks). It allows multiple fluids to be transported on the same line. It also has extra options in its GUI that the other types don't: Channels(Insertion and Extraction), Priority(Insertion), Filter Upgrades(Insertion and Extraction), Round Robin(Extraction), Self Feed(Extraction), Function Upgrades(Extraction). The GUI of all Fluid conduits is split between their 2 modes: insert and extract . These modes can be toggled independently. Insert Insertion can be configured in these ways: Channels ( 1 ) (Ender Fluid Conduits only) Channels are used to split a single fluid conduit network into multiple networks that act independently. There are 16 different channels. Each of them has a different color, corresponding to the 16 minecraft colors: Green, Brown, Blue, Purple, Cyan, Light Gray, Gray, Pink, Lime, Yellow, Light Blue, Magenta, Orange, White, Black Priority ( 2 ) (Ender Fluid Conduits only) The insertion uses the priority system. The priority is represented by an integer. The fluids will be inserted into the tanks with the highest priority first. Filter Upgrades ( 3 ) (Ender Fluid Conduits only) Insertion can be filtered. There is a single slot for filters. Extract Extraction can be configured in these ways: Channels ( 4 ) (Ender Fluid Conduits only) Channels are used to split a single fluid conduit network into multiple networks that act independently. There are 16 different channels. Each of them has a different color, corresponding to the 16 minecraft colors: Green, Brown, Blue, Purple, Cyan, Light Gray, Gray, Pink, Lime, Yellow, Light Blue, Magenta, Orange, White, Black Round Robin ( 5 ) (Ender Fluid Conduits only) If Round Robin is disabled, fluids will be inserted normally, Nearest-First, into the tanks with the highest priority. If Round Robin is enabled, fluids will be split equally between the tanks with the highest priority. Self Feed ( 6 ) (Ender Fluid Conduits only) Normally, Ender Fluid Conduits will not try to put fluids directly back into the block or machine they extracted them from. Switching on \"Self Feed\" will enable them to do so. Redstone Mode ( 7 ) (All Fluid Conduits) Controls when the extraction should happen in regards to Redstone Signal . It can be set to these modes: Always active Extraction is always active, ignoring redstone signal. Active with signal Extraction only happens if the conduit receives a redstone signal(power 1-15). If the redstone signal is transmitted by a redstone conduit, the Signal Color can be set. Active without signal Extraction only happens if the conduit doesn't receive a redstone signal(power 0). If the redstone signal is transmitted by a redstone conduit, the Signal Color can be set. Never active Extraction is never active, ignoring redstone signal. Filter Upgrades ( 8 ) (Ender Fluid Conduits only) Extraction can be filtered. There is a single slot for filters. Function Upgrades ( 9 ) (Ender Fluid Conduits only) The Speed of the Extraction can be modified using Speed Upgrades and Speed Downgrades . By default, ender fluid conduits have an extraction speed of 200 mB/t, which represents 100%. There's an info button ( 10 ) in the GUI that shows the Effective Speed while Hovering. Speed Upgrades Every added Speed Upgrade increases extraction speed by 100%. The Maximum Amount of Speed Upgrades that can be added in a fluid conduit is 15 , for a maximum extraction speed of 3200 mB/t! Speed Downgrades The Maximum Amount of Speed Downgrades that can be added in a fluid conduit is 3! 1 added Speed Downgrade decreases extraction speed to 25% fluid per operation( THE MINIMUM EXTRACTION SPEED = 50 mB/t ). 2 added Speed Downgrades decrease extraction speed to 50% fluid per operation(= 100 mB/t). 3 added Speed Downgrades decrease extraction speed to 75% fluid per operation(= 150 mB/t). Note: mB = milibuckets = 1/1000 Buckets IO = Input/Output"
    },
    {
      "title": "fluid_filters",
      "content": "Fluid Filters Only Ender Fluid Conduit can accept Fluid Filters.\nThe other types can be filtered to a scpecific fluid by right-clicking the conduit with a bucket. Basic Fluid Filter Filters fluids with whitelist / blacklist options. Used inside the Input/Output Filter Upgrade slot of the Ender Fluid Conduit . Has 5 fluid slots. Options: Whitelist * *(Default) / **Blacklist"
    },
    {
      "title": "fluid_tanks",
      "content": ""
    },
    {
      "title": "fluids",
      "content": "Fluids Ender IO adds 10 fluids: Nutrient Distillation Nutrient Distillation can be made in The Vat from Water and can be used to generate µI in the Zombie Generator and Frank'n'Zombie Generator. It can also be used in The Vat to make Dew of the Void and it can fill a stick in a Fluid Tank to create a Nutritious Stick. Dew of the Void Dew of the Void can be made in The Vat from Nutrient Distillation and can be used to generate µI in the Ender Generator. It can also be used in The Vat to make Vapor of Levity. The Rod of Return requires Dew of the Void to work. Vapor of Levity Vapor of Levity can be made in The Vat from Dew of the Void and can be used as Coolant in the Combustion Generator. The Staff of Levity and the Cold Fire Igniter require Vapor of Levity to work. Hootch Hootch can be made in The Vat from Water and can be used to generate µI in the Combustion Generator. It can also be used in The Vat to make Rocket Fuel and Fire Water. Rocket Fuel Rocket Fuel can be made in The Vat from Hootch and can be used to generate µI in the Combustion Generator. Fire Water Fire Water can be made in The Vat from Hootch and can be used to generate µI in the Combustion Generator and to obtain Grains of Infinity when placed on Bedrock. It can also be used in The Vat  to make Liquid Sunshine. Liquid XP Liquid XP can be obtained by collecting XP Orbs with an XP Vacuum or by emptying Bottles o' Enchanting in the Fluid Tank. It can be used to repair items enchanted with Mending in a Fluid Tank or it can be collected into an Experience Obelisk. Liquid Sunshine Liquid Sunshine can be made in The Vat from Fire Water and can be used as a Catalyst Fluid in the Weather Obelisk to stop Rain or Thunderstorms. Cloud Seed Cloud Seed can be made in The Vat from Water and can be used as a Catalyst Fluid in the Weather Obelisk to create Rain. It can also be used in The Vat to make Concentrated Cloud Seed. Concentrated Cloud Seed Concentrated Cloud Seed can be made in The Vat from Cloud Seed and can be used as a Catalyst Fluid in the Weather Obelisk to create Thunderstorms."
    },
    {
      "title": "frank_n_zombie",
      "content": ""
    },
    {
      "title": "glider_wings",
      "content": ""
    },
    {
      "title": "grains_of_infinity",
      "content": "(Picture goes here) Grains of Infinity are created by setting Bedrock on fire and letting it burn out naturally.  Provided that the fire burns for long enough, there is a 50% chance of it spawning Grains of Infinity.  Sometimes the fire burns out to quickly, so the actual chance is slightly under 50%. Grains of Infinity are not fire proof.  They do survive a little longer that most items, but they can be destroyed by fire. If Fire Ticks are disabled, Ender IO will cause fires on Bedrock to burn out after a certain amount of time. Starting fires automatically is easy to do using a vanilla Dispenser and a redstone clock, Observer, or Block Detector.  Vanilla Dispensers only use a Flint and Steel if the block in front of them is air or TNT, otherwise they do nothing."
    },
    {
      "title": "grinding_balls_endergy",
      "content": "Endergy Grinding Balls Crude Steel Grinding Ball Main Output 120% Bonus Output 125% Power Use 85% Cristalline Alloy Grinding Ball Main Output 180% Bonus Output 140% Power Use 145% Melodic Alloy Grinding Ball Main Output 200% Bonus Output 145% Power Use 155% Stelar Alloy Grinding Ball Main Output 230% Bonus Output 225% Power Use 220% Crystalline Pink Slime Grinding Ball Main Output 175% Bonus Output 155% Power Use 155% Energetic Silver Grinding Ball Main Output 160% Bonus Output 110% Power Use 110% Vivid Alloy Grinding Ball Main Output 175% Bonus Output 135% Power Use 135%"
    },
    {
      "title": "grinding_balls",
      "content": "Grinding Balls Electrical Steel Grinding Ball Main Output 120% Bonus Output 165% Power Use 80% Energetic Alloy Grinding Ball Main Output 160% Bonus Output 110% Power Use 110% Vibrant Alloy Grinding Ball Main Output 175% Bonus Output 135% Power Use 135% Redstone Alloy Grinding Ball Main Output 100% Bonus Output 100% Power Use 35% Conductive Iron Grinding Ball Main Output 135% Bonus Output 100% Power Use 100% Pulsating Iron Grinding Ball Main Output 100% Bonus Output 185% Power Use 100% Dark Steel Grinding Ball Main Output 135% Bonus Output 200% Power Use 70% Soularium Grinding Ball Main Output 120% Bonus Output 215% Power Use 90% End Steel Grinding Ball Main Output 140% Bonus Output 240% Power Use 70% Iron Alloy Grinding Ball Main Output 100% Bonus Output 25% Power Use 25%"
    },
    {
      "title": "guide_dark_steel_upgrades",
      "content": "Guide: Dark Steel Upgrades The Dark Steel Upgrade system was overhauled in Ender IO 5.0.49, and is now based on specific upgrade Items and GUIs rather than the old combining items in an Anvil system.  This guide explains how to use the new system. Dark Steel Upgrade is sometimes shortened to DSU. What You Will Need You will need some Dark|List-of-Dark-Weapons-Tools-and-Armor, Ender|List-of-Ender-Weapons-Tools-and-Armor, or Stellar|List-of-Stellar-Weapons-Tools-and-Armor (from the Endergy Add-on) equipment, and some Dark Steel Upgrades.  You will also need enough Experience to activate the upgrades. While not immediately necessary, you will want some kind of Dark Anvil|Guide-Dark-Steel-Upgrades#dark-anvils.  Some of Ender IO's XP storage tools (Experience Rod, Experience Obelisk, and/or Tank|Fluid Tanks filled with Liquid XP|Fluids#liquid-xp) will also come in handy. Obtaining Upgrades Crafting (Inactive Upgrades) You can craft the inactive Upgrades by using the Blank Dark Steel Upgrade|Dark-Steel-Upgrades#blank-dark-steel-upgrade Item, and then crafting that further into the upgrade you want.  You must activate this item using Experience before it can be applied. Inactive Upgrades do not have an Enchantment Shimmer, and their tooltips give info on activating them. Activating Upgrades There are 2 ways to activate Dark Steel Upgrades. Use Experience stored on the player by holding the inactive upgrade and Right Clicking (do not hold Shift).  This will use a number of levels specified on the inactive upgrade's tool tip. As with any vanilla Experience usage, this uses whole levels directly.  Consuming 4 levels while level 30 will bring you down to level 26 (and consume approximately 400 Experience Points) where as consuming 4 levels while only being level 4 would bring you down to level 0 (and only use approximately 40 Experience Points).  Storing excess Experience is recommended. Place the inactive upgrade in a Ender IO Tank filled with Liquid XP. As with other uses of Liquid XP, this will use the exact amount required to activate the upgrade (ex. 4 levels = 800 Liquid XP, which is exactly enough to activate a Dark Steel Upgrade needing 4 levels).  However, for particularly expensive upgrades there may not be a large enough Ender IO Tank to hold enough Liquid XP to activate the item. An activated Dark Steel Upgrade has an Enchantment Shimmer, and includes some information on how it can be installed in the tool tip. Salvaging Upgrades As we will see later in this guide, you can remove upgrades from equipment by using a Dark Anvil.  Partially upgraded Dark Steel equipment often spawns in loot chests. Installing Upgrades (Insert Only) More details about the Dark Steel Upgrade's Graphical User Interface (DSU GUI) is in the next section. If you do not have any kind of Dark Anvil available, then you can Shift + Right Click any Dark Steel Upgrade to open the DSU GUI in an Insert Only mode.  The only equipment that will be visible is the armor you have equipped, and items in your main or off hand (recommend putting tools in your off-hand).  Please make sure you have the correct item tab selected when inserting upgrades in this mode. While in Insert Only mode, the Storage Slots should not be usable (was an issue on very early post-overhaul versions), and installed upgrade cannot be removed (the slot's background disappears). Editing Upgrades (Insert, Extract, and Store) By using a Dark Anvil, you have full access to an item's DSU GUI.  The type of Dark Anvil used will determine what items are available to edit. There are several ways to open the DSU GUI. Use a Dark Steel Anvil or Dark Paper Anvil. Shift + Right Click any Dark Steel Upgrade (even a Blank DSU).  Dark Anvil Upgrade required to not be Insert Only. Have a Dark Anvil Upgrade installed and use a Keybind (no default, set yourself in the Controls menu). Shift + Right Click any piece of Equipment that has a Dark Anvil Upgrade and does not have a special Shift + Right Click Action (like Travel). The level of access will generally be the best one you have access to with the items equipped (armor + both hands). The DSU GUI has tabs on the right side showing the different pieces of equipment that can be edited.  Depending on the Dark Anvil used, you may see a vanilla Anvil GUI tabs, then tabs for the main hand, helmet, chestplate, leggings, boots, and the off-hand.  The final slot at the bottom can accept any piece of equipment from the inventory to reach that item's DSU GUI. The main GUI has the player's current inventory at the bottom, a row of inactive Storage Slots in the middle, and places for Active Upgrades up top. The Storage slots are there to store Upgrades you want to have on hand, but not be active at that time.  There are 9 available. The active slots up top are there to hold active upgrades.  If you hover over a slot, it will tell you the name of the upgrade, and if it requires other upgrades before it can be inserted.  A normal slot can accept the upgrade.  A red background requires a previous upgrade to be installed first.  An upgrade with the background slot removed indicates the upgrade cannot be removed at all (are in Insert Only mode, or are trying to extract something like Empowered I from a Staff of Travelling). You cannot insert upgrades unless any required upgrades are already active.  Similarly, you cannot remove an upgrade unless any upgrades that depend on it are removed prior. Dark Anvils There are 5 Dark Anvils in Ender IO.  2 are in-world and automatically max tier, while 3 are upgrades with increasing tiers. Editing Dark Steel Upgrades does not use an Anvil's Durability. Dark Paper Anvil The cheapest Dark Anvil.  The Dark Paper Anvil is an in-world Anvil that will give you full access to the DSU GUI.  However, when used as a vanilla Anvil it has minimal durability (will break after 3 uses). Dark Steel Anvil The Dark Steel Anvil is the other in-world Anvil.  It also gives full access to the DSU GUI, and when used as a vanilla Anvil has much greater durability (roughly twice as much as the vanilla Anvil). Dark Anvil Upgrades These can be installed on any piece of Dark equipment.  Like with other tiered upgrades, they have to be applied sequentially.  You will have to close and reopen the DSU GUI to update which anvil you are using. Micro Anvil The Micro Anvil Upgrade allows you to edit only the equipment it is installed in.  It also allows you to open the DSU GUI by Shift + Right Clicking that item (as long as it doesn't have another Shift + Right Click ability). Mini Anvil The Mini Anvil Upgrade allows you to edit any equipped items (armor and both hands).  You really only need 1 to be able to edit any piece of equipment, though it often requires some manual inventory management. Pocket Anvil The Pocket Anvil Upgrade gives full access to a Dark Anvil, including an infinite durability vanilla Anvil mode and the \"any equipment\" insertion slot."
    },
    {
      "title": "home",
      "content": "Welcome to the EnderIO Wiki here on GitHub! The Wiki This is now the official wiki, the old one was switched off because it was extremely outdated. Bugs If you wish to report a bug, please raise an issue in the issue tracker . Include as much information as you can, including the version of EnderIO and Minecraft. The more info the better, if I can't reproduce it, I probably can't fix it. Screenshots can/would be very helpful. Feature Requests If you wish to request a new feature please do the following: Go to the Suggestion Tracker and check if somebody hasn't already requested it. If you have done step 1 and it hasn't already been requested, raise a new suggestion. Otherwise vote for the existing one. Smile, you know you want to. Making me better If you would like, you can contribute to the wiki by forking this . Fix my awesome typing/spelling, whatever. Advanced Are you a server administrator, modpack maker or modder? Have a look at Non Gameplay Information. Enjoy,\nCP & team"
    },
    {
      "title": "inhibitor_obelisk",
      "content": ""
    },
    {
      "title": "installation_guide",
      "content": "Ender IO can be installed in 2 different ways: Monolithic or modular. In a monolithic installation you will have most of its content in one mod, called \"Ender IO\" and a couple of addons you can install in addition. This is how most players will use it. In a modular installation you leave out that \"all-in-one\" mod and install only those components you want. The same addons can be added here, too. This is intended for modpack makers. Here's an overview of what is what:"
    },
    {
      "title": "inventory_charger",
      "content": "Inventory Charger Requires: Crystals Simple Inventory Charger Charges neighboring items in your inventory. Basic Inventory Charger Charges all items in your inventory. Inventory Charger Charges all items in your inventory. Vibrant Inventory Charger Charges all items in your inventory."
    },
    {
      "title": "inventory_panel_remotes",
      "content": "Inventory Panel Remotes Are basically long range versions of the Inventory Panel, there are 3 versions, each acting as a upgrade to the previous. To use any of these remotes, they must be 'connected' to a already existing panel connected to a network. Shift right clicking a remote onto the Panel will connect it.\nEach type of remote must also be filled with energy and a liquid to function, the type of liquid it uses matters on the tier of the Remote. This liquid will also be consumed as well as a bit of energy with every time you open up the Remote, as well as interact with things like pull out items, place items in, etc. Inventory Panel Remote: Requires Nutrient Distillation to run, and it has a range of 5 chunks away from the Base Inventory Panel, that is roughly ~80 blocks. Advanced Inventory Panel Remote: Requires Dew Of The Void to run, its range is infinite in the same Dimension, it cannot function though if the chunk in which the base Inventory Panel is not Chunk Loaded! Ender Inventory Panel Remote: Requires Vapor Of Levity to run, it has infinite range, even across Dimensions, just like the advanced the chunk in which the base Inventory Panel is must be chunk loaded, otherwise it will not function."
    },
    {
      "title": "inventory_panel",
      "content": "The Inventory Panel is a machine which can be used to view and sort items throughout a set of storage blocks.  (Can be placed against a wall, or on the floor, facing up.) The slightly grayed out area shows your items that are found within any storage space the machine is connected too, the return area acts as a mini-storage space, (it can also be made into that if you click the button next to the name.) This acts as a input for transporting items back to storage spaces. For this machine to run you need a small set up of conduits, as well as a supply of 'Nutrient Distillation' which must be pumped into the Inventory Panel for it to function. Now, once you're ready to set up a storage system, you need to have 'Data Conduits' and 'Item Conduits.\" Simply place down your data conduits first, and then place your Inventory Panel onto the conduit. (This  allows it to float, without a block to attach to the pannel will fall onto the ground.) Once your Panel is placed, connect any storage block like a chest, and it should be connected, finaly place 2 buckets of nutrient distillation into the panel and it should light up! Now if anything is put into the storage items connected to the panel it will appear within its GUI. You can simply pull it out! But, how do you deal with bringing the items back? All you have to do is place item conduits between your Panel and your storage blocks, this gives you a chance to optionaly sort your items into storage blocks via a filter card! Make sure to set the item conduits to the right extract/insert mode! When you have items stored inside of the Panel, you can craft using the top-left section of the GUI, if you want to fill the input slots with the same items found within your storage system for a recipe. (For example, more cobblestone for a furnace.) You can shift click the button that is next to the output slot for crafting to fill in those items. Finaly, there are a set of ( ? ) buttons that are on the side of the GUI, if you're about to craft a item, one of them will light up, you can save recipes for later, so you can simply click it to automatically pull those items needed for the recipe into the crafting GUI! As a final note, here are some examples of the Panel working with other storage blocks from other mods.\n(Pictured: Actually Additions crate, Iron chests... Iron chest, RF Tools Modular Storage and IC2s Steel Storage block.)"
    },
    {
      "title": "inventory_sensor",
      "content": ""
    },
    {
      "title": "inventory_system_storage",
      "content": "(Please note, above Images are from the old design of the blocks, and are not updated to the new ones for now!) The Inventory System blocks are a set of difering sized inventories to be used with the Inventory Pannel system, they cannot be opened by hand, but they have a invisible inventory that can be used by the Inventory Panel. They are connected via a data cable, BUT they will only connect if the system has been given a power supply! Sadly not that much information is given at this moment of the exact sizes of each Storage block, but this may be updated to explain each storage size!"
    },
    {
      "title": "item_conduit",
      "content": "Item Conduit The Item Conduit transfers items between containers. The GUI is split between the 2 modes of an Item Conduit: insert and extract . They can be toggled independently. Insert Insertion can be configured in these ways: Channels ( 1 ) Channels are used to split a single item conduit network into multiple networks that act independently. There are 16 different channels. Each of them has a different color, corresponding to the 16 minecraft colors: Green, Brown, Blue, Purple, Cyan, Light Gray, Gray, Pink, Lime, Yellow, Light Blue, Magenta, Orange, White, Black Priority ( 2 ) The insertion uses the priority system. The priority is represented by an integer. The items will be inserted into the containers with the highest priority first. Filter Upgrades ( 3 ) Insertion can be filtered. There is a single slot for filters. Extract Extraction can be configured in these ways: Channels ( 4 ) Channels are used to split a single item conduit network into multiple networks that act independently. There are 16 different channels. Each of them has a different color, corresponding to the 16 minecraft colors: Green, Brown, Blue, Purple, Cyan, Light Gray, Gray, Pink, Lime, Yellow, Light Blue, Magenta, Orange, White, Black Round Robin ( 5 ) If Round Robin is disabled, items will be inserted normally, Nearest-First, into the containers with the highest priority. If Round Robin is enabled, items will be split equally between the containers with the highest priority. Self Feed ( 6 ) Normally, Item Conduits will not try to put fluids directly back into the block or machine they extracted them from. Switching on \"Self Feed\" will enable them to do so. Redstone Mode ( 7 ) Controls when the extraction should happen in regards to Redstone Signal . It can be set to these modes: Always active Extraction is always active, ignoring redstone signal. Active with signal Extraction only happens if the conduit receives a redstone signal(power 1-15). If the redstone signal is transmitted by a redstone conduit, the Signal Color can be set. Active without signal Extraction only happens if the conduit doesn't receive a redstone signal(power 0). If the redstone signal is transmitted by a redstone conduit, the Signal Color can be set. Never active Extraction is never active, ignoring redstone signal. Filter Upgrades ( 8 ) Extraction can be filtered. There is a single slot for filters. Function Upgrades ( 9 ) The Speed of the Extraction can be modified using Speed Upgrades and Speed Downgrades . By default, item conduits extract 4 items per operation. There's an info button ( 10 ) in the GUI that shows the Effective Speed while Hovering. Speed Upgrades Every added Speed Upgrade increases extraction speed by 4 items per operation. The Maximum Amount of Speed Upgrades that can be added in an item conduit is 15 , for a maximum extraction speed of 64 items per operation! Speed Downgrades The Maximum Amount of Speed Downgrades that can be added in an item conduit is 3! 1 added Speed Downgrade decreases extraction speed to 1 item per operation( THE MINIMUM EXTRACTION SPEED ). 2 added Speed Downgrades decrease extraction speed to 2 items per operation. 3 added Speed Downgrades decrease extraction speed to 3 items per operation."
    },
    {
      "title": "item_filters",
      "content": "Item Filters Basic Item Filter Filters items with whitelist / blacklist and metadata options. Used inside the Input/Output Filter Upgrade slot of the Item Conduit. Has 5 item slots. Options: Whitelist * *(Default) / **Blacklist Metadata Match (Default) Ignore Advanced Item Filter Filters items with advanced configuration options. Used inside the Input/Output Filter Upgrade slot of the Item Conduit. Has 10 item slots. Options: Whitelist * *(Default) / **Blacklist Metadata Match (Default) Ignore Ore Dictionary Disabled (Default) Enabled NBT Match (Default) Ignore Damage Ignore (Default) Up to 25% Damaged More than 25% Damaged Up to 50% Damaged More than 50% Damaged Up to 75% Damaged More than 75% Damaged Not Damaged Damaged Can be Damaged Cannot be Damaged Limited Item Filter Filters items based on their stack size in addition to the features of the Advanced Item Filter . Used inside the Input/Output Filter Upgrade slot of the Item Conduit. It limits the Insertion / Extraction into / from a connected inventory so that, in the inventory, there is always the number of items equal to the limit set inside the filter. Has 10 item slots. Options: Metadata Match (Default) Ignore Ore Dictionary Disabled (Default) Enabled NBT Match (Default) Ignore Damage Ignore (Default) Up to 25% Damaged More than 25% Damaged Up to 50% Damaged More than 50% Damaged Up to 75% Damaged More than 75% Damaged Not Damaged Damaged Can be Damaged Cannot be Damaged Big Item Filter Filters even more items with the same options as the Basic Item Filter . Used inside the Input/Output Filter Upgrade slot of the Item Conduit. Has 36 item slots. Options: Whitelist * *(Default) / **Blacklist Metadata Match (Default) Ignore Advanced Big Item Filter Filters even more items with advanced configuration options. Used inside the Input/Output Filter Upgrade slot of the Item Conduit. Has 36 item slots. Options: Whitelist * *(Default) / **Blacklist Metadata Match (Default) Ignore Ore Dictionary Disabled (Default) Enabled NBT Match (Default) Ignore Damage Ignore (Default) Up to 25% Damaged More than 25% Damaged Up to 50% Damaged More than 50% Damaged Up to 75% Damaged More than 75% Damaged Not Damaged Damaged Can be Damaged Cannot be Damaged Existing Item Filter Filters items based on a snapshot of the connected inventory. Used inside the Input/Output Filter Upgrade slot of the Item Conduit. Options: Metadata Ignore (Default) Match Whitelist * *(Default) / **Blacklist NBT Ignore (Default) Match Ore Dictionary Disabled (Default) Enabled Snapshot : Optional: If no snapshot is set, the inventory content will be used as a filter. Merge : Merge the current snapshot with a new one. Clear : Clear the snapshot. Show : Show the current snapshot. Mod Item Filter Filters items based on the mod they come from. Used inside the Input/Output Filter Upgrade slot of the Item Conduit. Has 3 mod slots. Options: Whitelist * *(Default) / **Blacklist Input Slots : For items; their mods will be automatically detected. Delete Buttons : For each mod slot. Power Item Filter Filters items based on their current energy. Used inside the Input/Output Filter Upgrade slot of the Item Conduit. Options: Comparison Mode = (Default) >= > < <= Power Percentage 100% (Default) 0% 25% 50% 75% Soul Item Filter Filters Soul Vials|Soul Vial based on mob id. Used inside the Input/Output Filter Upgrade slot of the Item Conduit. Has 5 Soul Vials|Soul Vial slots. Options: Whitelist * *(Default) / **Blacklist Sticky Mode Disabled (Default) Enabled: Selected Items will only be sent to this or other sticky outputs. Big Soul Item Filter Filters Soul Vials|Soul Vial based on mob id. Has more slots than the Soul Item Filter . Used inside the Input/Output Filter Upgrade slot of the Item Conduit. Has 10 Soul Vials|Soul Vial slots. Options: Whitelist * *(Default) / **Blacklist Sticky Mode Disabled (Default) Enabled: Selected Items will only be sent to this or other sticky outputs. Enchantment Item Filter Filters Enchanted Items / Books based on enchantment id. Cannot differentiate between different levels of the same enchantment. Used inside the Input/Output Filter Upgrade slot of the Item Conduit. Has 5 Enchantment slots. Options: Whitelist * *(Default) / **Blacklist Sticky Mode Disabled (Default) Enabled: Selected Items will only be sent to this or other sticky outputs. Big Enchantment Item Filter Filters Enchanted Items / Books based on enchantment id. Has more slots than the Enchantment Item Filter . Cannot differentiate between different levels of the same enchantment. Used inside the Input/Output Filter Upgrade slot of the Item Conduit. Has 10 Enchantment slots. Options: Whitelist * *(Default) / **Blacklist Sticky Mode Disabled (Default) Enabled: Selected Items will only be sent to this or other sticky outputs. Forestry Integration Species Item Filter Filters Forestry Species (of bees, trees etc.). Used inside the Input/Output Filter Upgrade slot of the Item Conduit. Has 5 Species slots. Options: Whitelist * *(Default) / **Blacklist Species Type Both (Default) Primary Secondary"
    },
    {
      "title": "killer_joe",
      "content": ""
    },
    {
      "title": "lights",
      "content": ""
    },
    {
      "title": "list_of_conduits",
      "content": "Energy Conduits Fluid Conduits Redstone Conduit Item Conduit"
    },
    {
      "title": "list_of_dark_weapons_tools_and_armor",
      "content": "Dark Weapons The Ender Dark Bow Dark Tools Dark Pick Dark Axe Dark Shears Dark Crook Dark Treetap Dark Armor Dark Helm Dark Plate Dark Leggings Dark Boots"
    },
    {
      "title": "list_of_ender_weapons_tools_and_armor",
      "content": "Ender Weapons The Ender Mk2 Ender Bow Ender Tools Ender Pickaxe Ender Axe Ender Armor Ender Helm Ender Plate Ender Leggings Ender Boots"
    },
    {
      "title": "list_of_generators",
      "content": "Combustion Generator Stirling Generator Zombie Generator"
    },
    {
      "title": "list_of_obelisks",
      "content": "Attractor Obelisk Aversion Obelisk Experience Obelisk Inhibitor Obelisk Relocator Obelisk Weather Obelisk"
    },
    {
      "title": "list_of_powered_machines",
      "content": "Alloy Smelter Buffers Crafter Dimensional Transceiver Farming Station Lights Painting Machine Powered Spawner SAG Mill Slice'N'Splice Soul Binder The Vat Wireless Charger"
    },
    {
      "title": "list_of_stellar_weapons_tools_and_armor",
      "content": "Stellar Weapons The Ender Mark IV Stellar Tools Stellar Pickaxe Stellar Axe Stellar Armor Stellar Helmet Stellar Chestplate Stellar Leggings Stellar Boots"
    },
    {
      "title": "list_of_unpowered_machines",
      "content": "Buffers Enchanter Killer Joe Lights Reservoir Fluid Tanks Vacuum Chest"
    },
    {
      "title": "loot_tables",
      "content": "Ender IO Base Base uses loot tables for its dungeon loot. See here . For changing loot tables, see here . Ender IO Zoo Zoo uses loot tables for its mob drops (implementation in progress). See here ."
    },
    {
      "title": "machine_chassis",
      "content": ""
    },
    {
      "title": "non_gameplay_information",
      "content": "Server administrators, modpack makers, modders and power users may want to change how Ender IO works on a deeper level than players. This page collects information for them. Loot Tables (modpacks, servers) API Capacitors (modders, modpacks) Configuration (modpacks, servers, users) Ender IO uses the normal Forge config system. You can use Forge's ingame configuration GUI in single player or edit the config files manually. Configuration is generally split up by module, but some settings are in 'base' even so the machines they affect are in other modules. Recipes (everyone) Ender IO uses an XML-based recipe system for all its recipes and some recipe-like configuration. All those recipes can be edited. When the game starts, Ender IO reads recipe data from 3 sources: The files bundled up in the jar (can be disabled with a config flag), snippets sent by other mods using the IMC system, all files in the 'recipes/user' folder. Each stage can modify (change or disable) recipes from the previous stage. Farming Tools (modders, modpacks) To enable your tools to be usable in the Farming Station you need to: Hoe: Either subclass ItemHoe or oreDict as toolHoe . Axe: Have a harvest level for axe above 0. Treetap: OreDict as toolTreetap . Shears: Either subclass ItemShears or oreDict as toolShears . The Slice'n'Splice uses the same logic for its axe and shears. API (modders) Ender IO has an extensive API you can use. It includes: Interfaces to bind addon mods tightly to the Ender IO base module ( IEnderIOAddon , IModObject , IModTileEntity ). You only need those if you want to make such a tightly coupled addon mod. A capability for code-based capacitors ( CapabilityCapacitorData etc). You can use those if the NBT-based API (see above) isn't enough for you. Interfaces and classes to add farming logic ( IFarmerJoe etc) and fertilizers ( IFertilizer ) to the Farming Station. Both are Forge-Registry-based, so you register them just like blocks and items. Interfaces to make your own Travel Anchors ( ITravelAccessable etc) or Staff of Travelling ( IItemOfTravel ). Interfaces to make a YETA-compatible wrench ( ITool ), an item to see through facades ( IHideFacades ), or selectively hide conduit types ( IConduitControl ). Interfaces to make your own \"Dark Steel Item\" ( IDarkSteelItem ) that can take \"Dark Steel Upgrades\" ( IDarkSteelUpgrade ). This also includes custom materials ( IEquipmentData ) and rendering on the player model ( IHasPlayerRenderer , IRenderUpgrade ). If you want to add conduits, there's a checklist in the API package on what to do. You will need more than just the API as conduits can be quite complicated."
    },
    {
      "title": "nutritious_stick",
      "content": ""
    },
    {
      "title": "painting_machine",
      "content": ""
    },
    {
      "title": "photovoltaic_cells",
      "content": "Photovoltaic Cells generate power from sunlight.  They can connect horizontally as a free-form multiblock.  The amount of power they generate vary throughout the day, maxing out around noon.  They must have a clear line of sight to the sky. There is a config option which determines if Photovoltaic Cells of different tiers can connect.  In 1.10 they default to allowing them to connect. In 1.7 and the upcoming 1.11 versions they default to not allowing them to connect to different tiers. Photovoltaic Cell Generates a peak of 10 RF/t. Advanced Photovoltaic Cell Generates a peak of 40 RF/t. Vibrant Photovoltaic Cell Generates a peak of 160 RF/t"
    },
    {
      "title": "potions",
      "content": "Potions Ender IO adds 3 potions(each type of potion has the 3 Vanilla variations: Normal, Splash and Lingering): Potion of Decay The Potion of Decay applies the Withering Effect to the target(s). There are 2 types of the Potion of Decay: The Normal Type, which applies Withering for 45 seconds(Normal and Splash) or 11 seconds(Lingering) The Extended Type, which applies Withering for 2 minutes(Normal and Splash) or 30 seconds(Lingering) Potion of Rising The Potion of Rising applies the Levitation Effect(the Vanilla effect applied by shulker shells) to the target(s). There are 3 types of the Potion of Rising: The Normal Type, which applies Levitation for 7 seconds(Normal and Splash) or 1 second(Lingering) The Extended Type, which applies Levitation for 28 seconds(Normal and Splash) or 7 seconds(Lingering) The Enhanced Type, which applies Levitation III for 7 seconds(Normal and Splash) or 1 second(Lingering) Potion of Confusion The Potion of Confusion applies the Nausea Effect(the Vanilla effect applied by eating Pufferfish) to the target(s). There are 2 types of the Potion of Confusion: The Normal Type, which applies Nausea for 45 seconds(Normal and Splash) or 11 seconds(Lingering) The Extended Type, which applies Nausea for 2 minutes(Normal and Splash) or 30 seconds(Lingering) There's also an arrow|Arrows corresponding to each potion, but with 1/9 the duration."
    },
    {
      "title": "powders_and_grains",
      "content": ""
    },
    {
      "title": "power_monitors",
      "content": "Power Monitor The Power Monitor is used to show statistics related to power on an attached Conduit Network.  It must be touching an Ender IO Energy Conduit|Energy Conduits.  You can see how much µI is stored in the Conduits|Energy Conduits ( 1 ), Capacitor Banks ( 2 ), and Machines ( 5 ) attached to the Conduit Network.  You can also see separate input ( 3 ) and output ( 4 ) µI/t for the network. In addition, the Power Monitor features a redstone control system useful for controlling generators.  When the amount of µI in storage (Capacitor Banks) drops below a certain value ( 7 ), the Power Monitor will emit a redstone signal.  When the amount of µI in storage rises above another value ( 8 ), the redstone signal stops.  Both of those values are configurable, and the system has to be enabled by clicking the tick box in the top left corner ( 6 ). The Power Monitor consumes 5 µI/t and stores up to 1,000 µI. Graphical Power Monitor The Graphical Power Monitor includes all of the features of the normal Power Monitor, but also has a graph that shows the amount of µI in storage over time.  This graph is rendered in the GUI ( 10 ), and on the front of the block. The time period described by the graph ( 11 ) can be set to different values: 10s, 1m, 10m, 1h, 10h, 24h, 7d. The Graphical Power Monitor consumes 5 µI/t, and stores up to 1,000 µI/t ( 9 )."
    },
    {
      "title": "powered_spawner",
      "content": ""
    },
    {
      "title": "pressure_plates",
      "content": ""
    },
    {
      "title": "redstone_conduit",
      "content": "Redstone Conduit The Redstone Conduit transfers Redstone Signal between blocks. The GUI is split between the 2 modes of a Redstone Conduit: input and output . They can be toggled independently. Input Input can be configured in these ways: Signal Color ( 1 ) Signal Colors are used to split a single redstone conduit network into multiple networks that act independently. There are 16 different signal colors, corresponding to the 16 minecraft colors: Green, Brown, Blue, Purple, Cyan, Light Gray, Gray, Pink, Lime, Yellow, Light Blue, Magenta, Orange, White, Black Filter Upgrades ( 2 ) There are different Redstone Filters that can be inserted into this slot, to change the behavior of Redstone Conduits. Output Redstone Conduits Output a Signal Strength equal to the sum of all Input Signal Strengths on the Channel, capped at 15. This behavior can be changed by Redstone Filters. Output can be configured in these ways: Signal Color ( 3 ) Signal Colors are used to split a single redstone conduit network into multiple networks that act independently. There are 16 different signal colors, corresponding to the 16 Minecraft colors: Green, Brown, Blue, Purple, Cyan, Light Gray, Gray, Pink, Lime, Yellow, Light Blue, Magenta, Orange, White, Black Strong Signal ( 4 ) Blocks can be powered, activated or both. Powered Blocks activate adjacent blocks. If Strong Signal is Disabled, the conduit will be powered, and it will activate any adjacent blocks like redstone lamps. If Strong Signal is Enabled, the conduit will power and activate the adjacent blocks, which themselves will activate any adjacent blocks to them. The best way to visualize this is with a screenshot: On the left, Strong Signal is Off, so the iron block is activated but not powered, so the redstone lamp doesn't activate. On the right, Strong Signal is On, so the iron block is both powered and activated, so the redstone lamp activates. Filter Upgrades ( 5 ) There are different Redstone Filters that can be inserted into this slot, to change the behavior of Redstone Conduits."
    },
    {
      "title": "redstone_filters",
      "content": "Redstone Filters Redstone Filters are used to change the behavior of Redstone Conduits|Redstone Conduit. Note: In the tables below, 0 denotes the absence of Redstone Signal (Signal Strength 0), while 1 denotes the presence of Redstone Signal (Signal Strength 1-15). Redstone Filter Base Used to craft the other Redstone Filters. Cannot be used inside the Redstone Conduits|Redstone Conduit. Redstone NOT Filter Used inside the Output Filter Upgrade slot of the Redstone Conduits|Redstone Conduit. Inverts the Input Signal(s). It always Outputs a Signal Strength of 15. Table of the NOT Filter Redstone OR Filter Used inside the Output Filter Upgrade slot of the Redstone Conduits|Redstone Conduit. Listens for Input Signal on 2 Channels. Channels can be configured by Editing Filter Settings in the Redstone Conduit GUI. Outputs Signal if it receives * Input Signal on * any configured Channel. It always Outputs a Signal Strength of 15. Table of the OR Filter Redstone AND Filter Used inside the Output Filter Upgrade slot of the Redstone Conduits|Redstone Conduit. Listens for Input Signal on 2 Channels. Channels can be configured by Editing Filter Settings in the Redstone Conduit GUI. Outputs Signal if it receives * Input Signal on * both configured Channels. It always Outputs a Signal Strength of 15. Table of the AND Filter Redstone NOR Filter An inverted Redstone OR Filter . Used inside the Output Filter Upgrade slot of the Redstone Conduits|Redstone Conduit. Listens for Input Signal on 2 Channels. Channels can be configured by Editing Filter Settings in the Redstone Conduit GUI. Outputs Signal if it doesn't receive * Input Signal on * any configured Channel. It always Outputs a Signal Strength of 15. Table of the NOR Filter Redstone NAND Filter An inverted Redstone AND Filter . Used inside the Output Filter Upgrade slot of the Redstone Conduits|Redstone Conduit. Listens for Input Signal on 2 Channels. Channels can be configured by Editing Filter Settings in the Redstone Conduit GUI. Outputs Signal if it doesn't receive * Input Signal on * both configured Channels. It always Outputs a Signal Strength of 15. Table of the NAND Filter Redstone XOR Filter Used inside the Output Filter Upgrade slot of the Redstone Conduits|Redstone Conduit. Listens for Input Signal on 2 Channels. Channels can be configured by Editing Filter Settings in the Redstone Conduit GUI. Outputs Signal if it receives * Input Signal on * any but not both configured Channels. It always Outputs a Signal Strength of 15. Table of the XOR Filter Redstone XNOR Filter An inverted Redstone XOR Filter . Used inside the Output Filter Upgrade slot of the Redstone Conduits|Redstone Conduit. Listens for Input Signal on 2 Channels. Channels can be configured by Editing Filter Settings in the Redstone Conduit GUI. Outputs Signal if it doesn't receive * Redstone Signal on * both * of the configured Channels or if it * receives * Input Signal on * both configured Channels. It always Outputs a Signal Strength of 15. Table of the XNOR Filter Redstone Toggle Latch Filter Used inside the Output Filter Upgrade slot of the Redstone Conduits|Redstone Conduit. Works as a T Flip-Flop. It toggles the Output Signal every time it receives an Input Signal. It always Outputs a Signal Strength of 15. Redstone Counting Filter Used inside the Output Filter Upgrade slot of the Redstone Conduits|Redstone Conduit. The Count can be configured by Editing Filter Settings in the Redstone Conduit GUI. Outputs Signal every time it receives Count Input Signals. Initially, the Counter is set to 0. The first Input Signal after Count Input Signals resets the Counter to 1, so it is counted as an Input Signal. It always Outputs a Signal Strength of 15. Redstone Sensor Filter Used inside the Input Filter Upgrade slot of the Redstone Conduits|Redstone Conduit. Works like a Comparator that measures block state . It transmits a Signal Strength in proportion to how full the container is (0 for empty, 15 for full, etc.). It can also measure some non-container blocks that can be measured by the Redstone Comparator. Redstone Timer Filter Used inside the Input Filter Upgrade slot of the Redstone Conduits|Redstone Conduit. The Time can be configured by Editing Filter Settings in the Redstone Conduit GUI. It transmits a Signal every Time game ticks. It can be disabled by powering the Redstone Conduit that contains it with a Redstone Signal. It always transmits a Signal Strength of 15."
    },
    {
      "title": "reinforced_obsidian",
      "content": ""
    },
    {
      "title": "relocator_obelisk",
      "content": ""
    },
    {
      "title": "remote_awareness_upgrade",
      "content": "This is a material used in the making most Inventory panel related functional items and blocks, such as Data conduits and System Storage Blocks"
    },
    {
      "title": "reservoir",
      "content": "Water Reservoir The Reservoir is a multi-block that can be built of any number of blocks in any shape. Each block holds one bucket of water. If there is enough water, an infinite water source will form inside. Then each block of the structure will produce up to one bucket of water per second. The minimal working size is 3 blocks, but 4 blocks is strongly recommended. Right-click with a wrench to enable auto-output for that block."
    },
    {
      "title": "rod_of_return",
      "content": ""
    },
    {
      "title": "sag_mill",
      "content": "Crushes items.  Used for ore doubling and as a crafting process. Upgrade with capacitors to increase speed and energy storage.  Speed is directly related to µI/t. Grinding Balls The slot on the right side of the GUI is for Grinding Balls.  Grinding balls provide bonus outputs and adjust power usage.  The Grinding Ball is consumed when it is first used by an appropriate recipe and must be fully used up before it can be replaced. Grinding Balls are only used in certain recipes determined by the recipe's bonus type.  If the recipe's bonus type is set to none (like Iron Ingot -> Iron Powder) then the Grinding Ball is not used (no increased output chance, no power reduction, and no durability used by the Grinding Ball). Main Output: The recipe output will be produced this many times.  Applies to all outputs.  For example, using dark steel (Main Output: 150%) will produce 1 set of items with a 50% chance of producing a second set. Bonus Output: The chances of the different outputs of the recipe are multiplied by this.  Only applies to outputs with a chance of appearing, maxes out at a 100% chance, and is applied before the Main Output multiplier. Power Use:  Adjusts energy cost of the recipe by the specified amount.  This indirectly changes the speed of the SAG Mill, and also affects the durability of the Grinding Balls. Durability: Specifies how long a Grinding Ball will last.  Measured in µI used by the SAG Mill.  Not visible in the game. Add-on Grinding Balls The following Grinding Balls are added by Ender IO, but are dependent on materials from other mods. Grinding Ball Example The SAG Mill will process 1 Diamond Ore at the cost of 3,600 µI.  It will produce 2 Diamonds, has a 25% chance of producing an auxiliary Diamond, a 15% chance of producing Cobblestone, and a 5% chance of producing Coal Powder. If you use a Dark Steel Ball, then the recipe only needs 70% of the base power, down to 2,520 µI.  If you are using an Octadic Capacitor, then the SAG Mill processes at 100 µI/t, meaning it takes 25.2 ticks (1.26 seconds) to process the ore rather than the previous 36 ticks (1.80 seconds).  The Dark Steel Ball will consume 2,520 points of durability (out of its maximum of 125,000). The Bonus Output increases chance based outputs by 200%, maxing at 100%.  The first two Diamonds don't benefit from the Bonus Output as they are already at 100%.  The auxiliary Diamond now has a 50% chance of being created.  Cobblestone is increased to a 30% chance, and Coal Powder is increased to a 10% chance. The Main Output bonus of 135% is applied to all items.  There is a 35% chance of doubling the entire output. The end result will be an average of 2.7 Diamonds per ore from the primary set, and 0.675 Diamonds per ore from the auxiliary Diamond, resulting in an average of 3.375 Diamonds per ore.  For reference, Fortune III averages out to 2.20 Diamonds per ore, and a SAG Mill with no Grinding Ball would produce an average of 2.25 Diamonds per ore."
    },
    {
      "title": "self_resetting_lever",
      "content": "Switches off after a certain time The self-resetting lever comes in 4 types by default (up to 16 types can be configured in the config file): 10 seconds, 30 seconds, 1 minute and 5 minutes. It will behave and look exactly like a vanilla lever, but it will switch off by itself after the time that's in its name."
    },
    {
      "title": "sentient_ender",
      "content": ""
    },
    {
      "title": "silicon",
      "content": ""
    },
    {
      "title": "simple_machines",
      "content": "Simple Machines are cheaper versions of Ender IO's starting machines.  They are cheaper, but are less capable, slower, hold less energy, don't respond to redstone signals, and most slowly leak excess energy. Tip: A Basic Capacitor Bank|Capacitor-Banks#basic-capacitor-bank doesn't require any alloys to craft, can limit its output, and reacts to a redstone signal. It can be used to mitigate energy loss. Simple Stirling Generator (Image goes here) Simple version of the Stirling Generator.  It burns furnace fuels to generate power.  It generates 20 µI/t and produces 10 µI per unit of burn time (1 Coal produces 16,000 µI).  It holds up to 1,000 µI, but leaks 1 µI/t.  It is unable to use Lava Buckets. Simple Alloy Smelter (Image goes here) Simple version of the Alloy Smelter.  It uses 10 µI/t when running, stores up to 1,000 µI, but leaks 1 µI/t constantly.  Unlike the normal Alloy Smelter, it cannot be used as a vanilla furnace.  It can only make Alloys. Simple SAG Mill (Image goes here) Simple version of the SAG Mill.  It uses 10 µI/t when running, stores up to 1,000 µI, but leaks 1 µI/t constantly.  It is unable to use Grinding Balls. Simple Crafter (Image goes here) Simple version of the Crafter.  It uses 10 µI/t when running and stores up to 10,000 µI.  Unlike the other Simple machines, it does not leak power."
    },
    {
      "title": "skeletal_contractor",
      "content": ""
    },
    {
      "title": "slice_and_splice",
      "content": ""
    },
    {
      "title": "soul_binder",
      "content": ""
    },
    {
      "title": "soul_vial",
      "content": ""
    },
    {
      "title": "staff_of_travelling",
      "content": ""
    },
    {
      "title": "stellar_axe",
      "content": "Stellar Axe The Stellar Axe is an axe added by Endergy. It can be enchanted with any Axe Enchantments (Vanilla or Modded). Dark Steel Upgrades: Direct Teleports mined things into your inventory Empowered Empowered I Max Power: 100,000 µI Damage absorbed by power: 50% Empowered II Max Power: 150,000 µI Damage absorbed by power: 60% Empowered III Max Power: 250,000 µI Damage absorbed by power: 70% Empowered IV Max Power: 1,000,000 µI Damage absorbed by power: 85% Empowered V Max Power: 2,500,000 µI Damage absorbed by power: 95% Fork Who needs a hoe when you have a fork... Micro Anvil Allows editing upgrades of a single item in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Mini Anvil Allows editing upgrades of all equiped items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Pocket Anvil Provides full anvil functionality and allows editing upgrades of any items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that."
    },
    {
      "title": "stellar_boots",
      "content": "Stellar Boots The Stellar Boots are boots added by Endergy. They can be enchanted with any Boots Enchantments (Vanilla or Modded). When they are powered, they have extra Armor and Armor Toughness: Not Powered: + 8 Armor and + 7 Armor Toughness Powered: + 10 Armor and + 9 Armor Toughness Dark Steel Upgrades: Apiarist's Shoes (Forestry Integration) Protection against bees Empowered Empowered I Max Power: 100,000 µI Damage absorbed by power: 50% Empowered II Max Power: 150,000 µI Damage absorbed by power: 60% Empowered III Max Power: 250,000 µI Damage absorbed by power: 70% Empowered IV Max Power: 1,000,000 µI Damage absorbed by power: 85% Empowered V Max Power: 2,500,000 µI Damage absorbed by power: 95% Flippers Increases swimming speed Inventory Inventory I Adds an inventory to you armor The size = 6 slots Set the hotkey to open it in the game options Inventory II Increases the size of your armor's inventory The size = 12 slots Set the hotkey to open it in the game options Inventory III Increases the size of your armor's inventory The size = 18 slots Set the hotkey to open it in the game options Jump Jump I Increases step and jump height Jump II Increases step and jump height Allows double jumps Jump III Increases step and jump height Allows triple jumps Micro Anvil Allows editing upgrades of a single item in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Mini Anvil Allows editing upgrades of all equiped items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Pocket Anvil Provides full anvil functionality and allows editing upgrades of any items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Thaumaturge's Boots (Thaumcraft Integration) Vis Discount: 2%"
    },
    {
      "title": "stellar_chestplate",
      "content": "Stellar Chestplate The Stellar Chestplate is a chestplate added by Endergy. It can be enchanted with any Chestplate Enchantments (Vanilla or Modded). When it is powered, it has extra Armor and Armor Toughness: Not Powered: + 18 Armor and + 7 Armor Toughness Powered: + 22 Armor and + 9 Armor Toughness Dark Steel Upgrades: Apiarist's Shirt (Forestry Integration) Protection against bees Elytra Makes armor work as elytra (That means flying as if an Elytra was equipped, NOT \"creative\" flight!) Set the hotkey to activate/deactivate it in the game options Incompatible with Glider Empowered Empowered I Max Power: 100,000 µI Damage absorbed by power: 50% Empowered II Max Power: 150,000 µI Damage absorbed by power: 60% Empowered III Max Power: 250,000 µI Damage absorbed by power: 70% Empowered IV Max Power: 1,000,000 µI Damage absorbed by power: 85% Empowered V Max Power: 2,500,000 µI Damage absorbed by power: 95% Glider Enables Gliding Set the hotkey to activate/deactivate it in the game options Incompatible with Elytra Inventory Inventory I Adds an inventory to you armor The size = 18 slots Set the hotkey to open it in the game options Inventory II Increases the size of your armor's inventory The size = 36 slots Set the hotkey to open it in the game options Inventory III Increases the size of your armor's inventory The size = 54 slots Set the hotkey to open it in the game options Micro Anvil Allows editing upgrades of a single item in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Mini Anvil Allows editing upgrades of all equiped items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Pocket Anvil Provides full anvil functionality and allows editing upgrades of any items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Thaumaturge's Robe   (Thaumcraft Integration) Vis Discount: 3%"
    },
    {
      "title": "stellar_helmet",
      "content": "Stellar Helmet The Stellar Helmet is a helmet added by Endergy. It can be enchanted with any Helmet Enchantments (Vanilla or Modded). When it is powered, it has extra Armor and Armor Toughness: Not Powered: + 7 Armor and + 7 Armor Toughness Powered: + 10 Armor and + 9 Armor Toughness Dark Steel Upgrades: Apiarist's Hat (Forestry Integration) Protection against bees Empowered Empowered I Max Power: 100,000 µI Damage absorbed by power: 50% Empowered II Max Power: 150,000 µI Damage absorbed by power: 60% Empowered III Max Power: 250,000 µI Damage absorbed by power: 70% Empowered IV Max Power: 1,000,000 µI Damage absorbed by power: 85% Empowered V Max Power: 2,500,000 µI Damage absorbed by power: 95% Inventory Inventory I Adds an inventory to you armor The size = 2 slots Set the hotkey to open it in the game options Inventory II Increases the size of your armor's inventory The size = 4 slots Set the hotkey to open it in the game options Inventory III Increases the size of your armor's inventory The size = 6 slots Set the hotkey to open it in the game options Micro Anvil Allows editing upgrades of a single item in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Mini Anvil Allows editing upgrades of all equiped items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Pocket Anvil Provides full anvil functionality and allows editing upgrades of any items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Naturalist's Eye (Forestry Integration) Shows pollinated tree leaves Night Vision Gives you the Night Vision Effect indefinitely(you can activate/deactivate it) Set the hotkey to activate/deactivate it in the game options Padding Muffles nearby sounds Revealing (Thaumcraft Integration) Vis Discount: 5% Solar Simple Solar Generates power from the sun Solar I Generates power from the sun Solar II Generates power from the sun Solar III Generates power from the sun Sound Locator Displays the location of nearby sounds The One Probe (The One Probe Integration) Adds TOP functionality to the Helmets"
    },
    {
      "title": "stellar_leggings",
      "content": "Stellar Leggings The Stellar Leggings are leggings added by Endergy. They can be enchanted with any Leggings Enchantments (Vanilla or Modded). When they are powered, they have extra Armor and Armor Toughness: Not Powered: + 14 Armor and + 7 Armor Toughness Powered: + 15 Armor and + 9 Armor Toughness Dark Steel Upgrades: Apiarist's Pants (Forestry Integration) Protection against bees Empowered Empowered I Max Power: 100,000 µI Damage absorbed by power: 50% Empowered II Max Power: 150,000 µI Damage absorbed by power: 60% Empowered III Max Power: 250,000 µI Damage absorbed by power: 70% Empowered IV Max Power: 1,000,000 µI Damage absorbed by power: 85% Empowered V Max Power: 2,500,000 µI Damage absorbed by power: 95% Inventory Inventory I Adds an inventory to you armor The size = 10 slots Set the hotkey to open it in the game options Inventory II Increases the size of your armor's inventory The size = 20 slots Set the hotkey to open it in the game options Inventory III Increases the size of your armor's inventory The size = 30 slots Set the hotkey to open it in the game options Micro Anvil Allows editing upgrades of a single item in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Mini Anvil Allows editing upgrades of all equiped items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Pocket Anvil Provides full anvil functionality and allows editing upgrades of any items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Speed Speed I Increases movement speed Speed II Increases movement speed Speed III Increases movement speed Thaumaturge's Leggings   (Thaumcraft Integration) Vis Discount: 3%"
    },
    {
      "title": "stellar_pickaxe",
      "content": "Stellar Pickaxe The Stellar Pickaxe is a pickaxe added by Endergy. It can be enchanted with any Pickaxe Enchantments (Vanilla or Modded). It has a Harvest Level = 5 (equivalent to a Cobalt Pickaxe), but it can be configured to have a Harvest Level = 3 (equivalent to a Diamond Pickaxe), by switching canMineTiCArdite = false in enderio.cfg. Dark Steel Upgrades: Carpeting Mining Range = Mining Volume + 1, if Depth is NOT present(See Explosive) Mining Range = Mining Volume - 1, if Depth is present(See Explosive) Flattens the explosive force into a carpet. Depth Mining Depth = Mining Volume + 1 (See Explosive) Directs the explosive force away from the player. Direct Teleports mined things into your inventory Empowered Empowered I Max Power: 100,000 µI Damage absorbed by power: 50% Empowered II Max Power: 150,000 µI Damage absorbed by power: 60% Empowered III Max Power: 250,000 µI Damage absorbed by power: 70% Empowered IV Max Power: 1,000,000 µI Damage absorbed by power: 85% Empowered V Max Power: 2,500,000 µI Damage absorbed by power: 95% Explosive Explosive I: Mining Volume = 1 Adds explosive power to the pickaxe, damaging surrounding blocks while mining. For problems that look like nails. Explosive II: Mining Volume = 2 Adds more explosive power to the pickaxe, damaging surrounding blocks while mining. For problems that look like nails. Explosive III: Mining Volume = 3 Adds even more explosive power to the pickaxe, damaging surrounding blocks while mining. For problems that look like nails. Explosive IV: Mining Volume = 4 Adds ridiculous explosive power to the pickaxe, damaging surrounding blocks while mining. For problems that look like combs. Explosive V: Mining Volume = 5 Adds ludicrous explosive power to the pickaxe, damaging surrounding blocks while mining. https://youtu.be/ygE01sOhzz0 Henry and tterrag want you to watch the full movie. \"You owe it to yourself\" - tterrag Micro Anvil Allows editing upgrades of a single item in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Mini Anvil Allows editing upgrades of all equiped items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Pocket Anvil Provides full anvil functionality and allows editing upgrades of any items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Spoon Who needs a shovel when you have a spoon... Travel Hold Shift and Right-Click to teleport or activate a travel anchor"
    },
    {
      "title": "stirling_generator",
      "content": "Generates energy from furnace fuels. Upgrade with capacitors to increase speed and efficiency."
    },
    {
      "title": "telepad",
      "content": ""
    },
    {
      "title": "the_ender_mark_iv",
      "content": "The Ender Mark IV After 47 attempts, Randalf finally made the ultimate weapon! The Ender Mark IV is a sword added by Endergy. It can be enchanted with any Sword Enchantments (Vanilla or Modded). Skull and Ender Pearl drops increase when killing mobs with the Ender Mark IV( doesn't have to be Powered ). When it is Powered, Endermen can't teleport once hit, and it has Extra Damage and Speed: Not Powered: Attack Speed = 1.6 and Attack Damage = 15 Empowered I (and Powered): Attack Speed = 2 and Attack Damage = 16 Empowered II (and Powered): Attack Speed = 2.05 and Attack Damage = 17 Empowered III (and Powered): Attack Speed = 2.1 and Attack Damage = 18 Empowered IV (and Powered): Attack Speed = 2.15 and Attack Damage = 19 Empowered V (and Powered): Attack Speed = 2.2 and Attack Damage = 20 Dark Steel Upgrades: Direct Teleports mined things into your inventory Empowered Empowered I Max Power: 100,000 µI Damage absorbed by power: 50% Empowered II Max Power: 150,000 µI Damage absorbed by power: 60% Empowered III Max Power: 250,000 µI Damage absorbed by power: 70% Empowered IV Max Power: 1,000,000 µI Damage absorbed by power: 85% Empowered V Max Power: 2,500,000 µI Damage absorbed by power: 95% Micro Anvil Allows editing upgrades of a single item in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Mini Anvil Allows editing upgrades of all equiped items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Pocket Anvil Provides full anvil functionality and allows editing upgrades of any items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Travel Hold Shift and Right-Click to teleport or activate a travel anchor"
    },
    {
      "title": "the_ender_mk2",
      "content": "The Ender Mk2 The Ender Mk2 is a sword added by Ender IO. It can be enchanted with any Sword Enchantments (Vanilla or Modded). Skull and Ender Pearl drops increase when killing mobs with the Ender Mk 2( doesn't have to be Powered ). When it is Powered, Endermen can't teleport once hit, and it has Extra Damage and Speed: Not Powered: Attack Speed = 1.6 and Attack Damage = 9 Empowered I (and Powered): Attack Speed = 2 and Attack Damage = 10 Empowered II (and Powered): Attack Speed = 2.05 and Attack Damage = 11 Empowered III (and Powered): Attack Speed = 2.1 and Attack Damage = 12 Empowered IV (and Powered): Attack Speed = 2.15 and Attack Damage = 13 Empowered V (and Powered): Attack Speed = 2.2 and Attack Damage = 14 Dark Steel Upgrades: Direct Teleports mined things into your inventory Empowered Empowered I Max Power: 100,000 µI Damage absorbed by power: 50% Empowered II Max Power: 150,000 µI Damage absorbed by power: 60% Empowered III Max Power: 250,000 µI Damage absorbed by power: 70% Empowered IV Max Power: 1,000,000 µI Damage absorbed by power: 85% Empowered V Max Power: 2,500,000 µI Damage absorbed by power: 95% Micro Anvil Allows editing upgrades of a single item in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Mini Anvil Allows editing upgrades of all equiped items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Pocket Anvil Provides full anvil functionality and allows editing upgrades of any items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Travel Hold Shift and Right-Click to teleport or activate a travel anchor"
    },
    {
      "title": "the_ender",
      "content": "The Ender The Ender is a sword added by Ender IO. It can be enchanted with any Sword Enchantments (Vanilla or Modded). Skull and Ender Pearl drops increase when killing mobs with the Ender ( doesn't have to be Powered ). When it is Powered, Endermen can't teleport once hit, and it has Extra Damage and Speed: Not Powered: Attack Speed = 1.6 and Attack Damage = 7 Empowered I (and Powered): Attack Speed = 2 and Attack Damage = 8 Empowered II (and Powered): Attack Speed = 2.05 and Attack Damage = 9 Empowered III (and Powered): Attack Speed = 2.1 and Attack Damage = 10 Empowered IV (and Powered): Attack Speed = 2.15 and Attack Damage = 11 Dark Steel Upgrades: Direct Teleports mined things into your inventory Empowered Empowered I Max Power: 100,000 µI Damage absorbed by power: 50% Empowered II Max Power: 150,000 µI Damage absorbed by power: 60% Empowered III Max Power: 250,000 µI Damage absorbed by power: 70% Empowered IV Max Power: 1,000,000 µI Damage absorbed by power: 85% Micro Anvil Allows editing upgrades of a single item in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Mini Anvil Allows editing upgrades of all equiped items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Pocket Anvil Provides full anvil functionality and allows editing upgrades of any items in the field. Activate with a hotkey or by shift-right-clicking any upgradeable item that doesn't do anything else when doing that. Travel Hold Shift and Right-Click to teleport or activate a travel anchor"
    },
    {
      "title": "the_vat",
      "content": ""
    },
    {
      "title": "tormented_enderman_head",
      "content": ""
    },
    {
      "title": "translating_ender_io",
      "content": "Ender IO's lang files are split just like the mod itself is. You will find them in: https://github.com/SleepyTrousers/EnderIO/tree/master/enderio-base/src/main/resources/assets/enderio/lang https://github.com/SleepyTrousers/EnderIO/tree/master/enderio-conduits/src/main/resources/assets/enderio/lang https://github.com/SleepyTrousers/EnderIO/tree/master/enderio-integration-forestry/main/resources/assets/enderio/lang https://github.com/SleepyTrousers/EnderIO/tree/master/enderio-integration-tic/src/main/resources/assets/enderio/lang https://github.com/SleepyTrousers/EnderIO/tree/master/enderio-machines/src/main/resources/assets/enderio/lang All the \"old\" lang files which were made for 1.10.2 or an even older version have been removed. You can find the old files here: https://github.com/SleepyTrousers/EnderIO/tree/1.10/resources/assets/enderio/lang Please note that there are a number of \"guess\" file which are automatically generated. They contain all keys that are needed (although they are in no good order) and try to guess which of the old translations may fit. A word on the state of the en_us files: \"integration-tic\" and \"integration-forestry\" are done. \"base\" and \"machines\" should be quite stable. \"conduits\" may change dramatically. \"invpanel\" hasn't even been started."
    },
    {
      "title": "travel_anchor",
      "content": ""
    },
    {
      "title": "upgrades",
      "content": "Upgrades Used inside Item Conduits|Item Conduit and Fluid Conduits to change Extraction Speed. Extract Speed Upgrade Item Conduits Every added Speed Upgrade increases extraction speed by 4 items per operation. The Maximum Amount of Speed Upgrades that can be added in an item conduit is 15 , for a maximum extraction speed of 64 items per operation! Fluid Conduits Every added Speed Upgrade increases extraction speed by 100%. The Maximum Amount of Speed Upgrades that can be added in a fluid conduit is 15 , for a maximum extraction speed of 3200 mB/t! Extract Speed Downgrade Item Conduits The Maximum Amount of Speed Downgrades that can be added in an item conduit is 3! 1 added Speed Downgrade decreases extraction speed to 1 item per operation( THE MINIMUM EXTRACTION SPEED ). 2 added Speed Downgrades decrease extraction speed to 2 items per operation. 3 added Speed Downgrades decrease extraction speed to 3 items per operation. Fluid Conduits The Maximum Amount of Speed Downgrades that can be added in a fluid conduit is 3! 1 added Speed Downgrade decreases extraction speed to 25% fluid per operation( THE MINIMUM EXTRACTION SPEED = 50 mB/t ). 2 added Speed Downgrades decrease extraction speed to 50% fluid per operation(= 100 mB/t). 3 added Speed Downgrades decrease extraction speed to 75% fluid per operation(= 150 mB/t)."
    },
    {
      "title": "vacuum_chest",
      "content": ""
    },
    {
      "title": "weather_obelisk",
      "content": ""
    },
    {
      "title": "why_are_my_conduits_red",
      "content": "Why are my conduits red? Conduits go offline when they are partially in unloaded chunks. Then they are colored red. How do I fix that? Make sure that conduit lines are completely in loaded chunks. You can employ chunk loader along the way or use Dimensional Transceivers to not have a long line of conduits. Are red conduits bad? No. They are just not working. It is no issue for your conduits to be red when you don't need them."
    },
    {
      "title": "wireless_charger",
      "content": ""
    },
    {
      "title": "xp_vacuum",
      "content": ""
    },
    {
      "title": "yeta_wrench",
      "content": "Yeta Wrench The Yeta Wrench is a tool that has a lot of uses: Conduit Facades are hidden while the Yeta Wrench is held Machines and Conduits can be broken by Shift + Right Clicking with the Yeta Wrench Extract and Insert(or Input and Output) modes can be changed by Right Clicking with the Yeta Wrench on a Conduit Bundle Conduits can be disconnected by Right Clicking with the Yeta Wrench on the connection Different Types of Conduits and Facades can be Hidden by scrolling through the display menu with Shift + Mouse Wheel or with Y. When the display menu is set to Facades, the Facades are shown and can be removed by Shift + Right Clicking with the Yeta Wrench."
    },
    {
      "title": "z_logic_controller",
      "content": ""
    },
    {
      "title": "zombie_electrode",
      "content": ""
    },
    {
      "title": "zombie_generator",
      "content": "Generates power from Nutrient Distillation.  Requires at least 1,400mB to generate power.  Generates 80 RF/t while consuming Nutrient Distillation at a rate of 10 t/mB."
    },
    {
      "title": "_footer",
      "content": "This wiki is being rewritten from scratch, and mechanics may change during the mod's development.  Currently, the information on this wiki is largely incomplete and may be out of date.  If you want to make this wiki better, here are directions on how to Contribute to the wiki | Contributing to the Wiki."
    },
    {
      "title": "_sidebar",
      "content": "Guides Dark Steel Upgrades|Guide Dark Steel Upgrades Base Energy (µI) Alloys Crafting Components|List of Crafting Components Dark Weapons, Tools, and Armor|List of Dark Weapons Tools and Armor Ender Weapons, Tools, and Armor|List of Ender Weapons Tools and Armor Dark Steel Upgrades Enchantments Machines Simple Machines Generators|List of Generators Powered Machines|List of Powered Machines Unpowered Machines|List of Unpowered Machines Enhanced Machines|List of Enhanced Machines Obelisks|List of Obelisks Conduits Conduits|List of Conduits Filters Upgrades Capacitor Banks Facades|Conduit Facades Power Monitors Energy Gauge Inventory Panel ( Dev Build Only ) Inventory Panel Inventory Panel Remotes Inventory System Storage Inventory Sensor Remote Awareness Upgrade Endergy Alloys|Alloys Endergy Grinding Balls|Grinding Balls Endergy Energy Conduits|Energy Conduits Endergy Capacitors|Capacitors Endergy Stellar Weapons, Tools, and Armor|List of Stellar Weapons Tools and Armor"
    }
  ]
}